[
    {
        "title": "Two suspects shot, killed during a home invasion in Clay County",
        "url": "https://www.wtvq.com/two-suspects-shot-killed-during-a-home-invasion-in-clay-county/",
        "published_date": "2025-02-17T13:34:59+00:00",
        "source_name": "Unknown source",
        "author": "John Croft",
        "category": "general",
        "content": "Sections\nAbout\nConnect With Us\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat's On TV Now\n\nComplete TV Programming\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLocal Events\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2025 WTVQ.\n\n\n\n\r\n\tTalk to ABC 36 News anchors, reporters and meteorologists. When you see news happening, share it! We’d love to hear from you.\r\n\n\n859-299-3636|news36@wtvq.com\n\n\n6940 Man O' War Blvd. Lexington, KY 40509\n\n\r\n\tWe live, work and play right here in Central Kentucky. We are your neighbors. We celebrate community and we tell your stories. We are the most trusted source for local news.\r\n\nDownload the ABC 36 News App on your smart phone or tablet device to receive breaking news and weather push notifications the minute it happens.\r\n\n\nMobile App | WEATHER App | WTVQ Email Sign Up\n"
    },
    {
        "title": "Estepona home support 24-hour",
        "url": "https://euroweeklynews.com/2025/02/17/estepona-home-support-24-hour/",
        "published_date": "2025-02-17T13:34:32+00:00",
        "source_name": "Unknown source",
        "author": "Adam Woodward",
        "category": "general",
        "content": "By Adam Woodward • Published: 17 Feb 2025 • 14:34 • 1 minute read\n\nFree home help in Estepona. Credit: PeopleImages.com - Yuri A - Shutterstock\n\nEstepona council has launched a new 24-hour, 365-day home help service with a free telephone service point so people can make enquiries or communicate any type of incident or worry.\n\nThis Centro de Atención al Usuario is one of the latest additions to the council’s home help service, aimed at residents with some degree of dependence or a situation of vulnerability.\n\n2025 has begun with an increase in the number of people benefitting from home help in Estepona, having closed the month of January with a total of 730 registered people, compared to the 665 last year.\n\n“The importance of this service provided by the council is for all people, the vast majority of them elderly, who have support needs, and also for the peace of mind of their families,” said the councillor for Social Welfare, María Aguilar.\n\nThe general demographic of users of the service so far has been women between 80 and 89 years old, according to data recorded from 2024. Of the total number of people helped, 68 percent were women, compared to 32 percent men. Most of these users are in the age range between 70 and over 90 years.\n\nThe council has also improved the home help service by increasing the technical aid material available. These are measures that help in the movements of users of the service in their homes, such as electric orthopaedic cranes of up to 180 kilos, 30 articulated lifting beds with railings, anti-bedsore mattresses, 40 shower chairs and toilets with wheels, and walking aid devices (walkers, crutches, and canes), in addition to artificial intelligence home devices that include a virtual assistant, voice control, and motion sensors.\n\nThe council has spent €60,000 extra this last year on services and equipment for those with less mobility. Those who think they may need to be signed up to the service can do so through their doctor or at the town hall."
    },
    {
        "title": "TYT welcomes courtesy visit by Cuepacs Sarawak delegation",
        "url": "https://www.theborneopost.com/2025/02/17/tyt-welcomes-courtesy-visit-by-cuepacs-sarawak-delegation/",
        "published_date": "2025-02-17T13:34:18+00:00",
        "source_name": "Unknown source",
        "author": "Lim How Pim",
        "category": "general",
        "content": "KUCHING (Feb 17): A delegation from the Congress of Unions for Employees in Public and Civil Service (Cuepacs) Sarawak paid a courtesy call on Yang Di-Pertua Negeri Sarawak Tun Pehin Sri Dr Wan Junaidi Tuanku Jaafar and his wife Toh Puan Datuk Patinggi Fauziah Mohd Sanusi today.\n\nCuepacs Sarawak chairman Jubilee Jineh, who led the visitors, briefed Wan Junaidi on the role and objectives of the union.\n\nThe visit, which took place at Astana Negeri in Petra Jaya here, also meant to introduce to the Head of State the new leadership of the state Cuepacs.\n\nMet by reporters later, Jubilee said Cuepacs Sarawak would continue to fight for the interests of civil servants across the state.\n\n“The meeting also discussed the notion of increasing contributions from 13 per cent to 18 per cent,” he added."
    },
    {
        "title": "Pashinyan to hold meeting with major taxpayers",
        "url": "http://www.panarmenian.net/eng/news/319451/",
        "published_date": "2025-02-17T13:33:48+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "PanARMENIAN.Net - Armenian Prime Minister Nikol Pashinyan has announced plans to hold a workshop with executives from companies that paid 50 million drams or more in taxes in 2024. He shared this information on his Facebook page.\n\n“We are all aware of the shortcomings in governance, and no one denies them. Government representatives, including myself, regularly receive letters highlighting concerns from the business community. Based on my review of these letters, I have concluded that there is a need for a joint format—bringing together the Government, Parliament, local authorities, and the business sector—to address economic and investment environment challenges, improve governance efficiency, and set reform priorities. I plan to organize such a workshop soon,” Pashinyan wrote.\n\nThe Prime Minister emphasized that the meeting is open not only to major taxpayers but also to representatives of small and medium-sized enterprises (SMEs) and the broader business community interested in discussing their concerns.\n\n\"I invite the executives of companies that paid 50 million drams or more in taxes in 2024 to participate, particularly those who want to share their ideas on improving the business environment. I also encourage leaders of organizations representing the business sector, including SMEs, to bring forward issues affecting their members who may not have direct access to the meeting,\" he added.\n\nApplications for participation must be submitted by February 28 to workshop2025@gov.am, including three key issues related to the current business environment. The most frequently mentioned issues will shape the workshop agenda.\n\nThe workshop is scheduled for April 2024, with selected participants to be informed of the exact date and location in due course."
    },
    {
        "title": "Chris Stapleton, Dale Earnhardt Jr. Team up for Top 10 Finish at Daytona 500",
        "url": "https://americansongwriter.com/chris-stapleton-dale-earnhardt-jr-team-up-for-top-10-finish-at-daytona-500/",
        "published_date": "2025-02-17T13:33:48+00:00",
        "source_name": "Unknown source",
        "author": "Cindy Watts",
        "category": "general",
        "content": "According to Dale Earnhardt Jr., Chris Stapleton spent the bulk of Sunday’s Daytona 500 glued to the action on the famous 2.5-mile racetrack.\n\n\n\n“The man Chris Stapleton has not left the pit box today when the race has been green,” Earnhardt Jr. said on Facebook Sunday. “He’s totally into this deal. It’s been fun. He was very involved from day one. Design of car and all.”\n\n\n\nIn January, Earnhardt Jr.’s company, JR Motorsports, announced it had teamed with Stapleton for the inaugural entry for JRM in the NASCAR Cup Series at the 2025 DAYTONA 500. The award-winning Buffalo Trace Distillery bottles Stapleton’s Traveller Whiskey. JRM and the distillery fielded the No. 40 Traveller Whiskey Chevrolet, inspired by the Blend No. 40 in Traveller. Defending NASCAR Xfinity Series Champion Justin Allgaier drove the Chevrolet to a Top 10 finish despite several multi-car pileups at the end of the race.\n\nVideos by American Songwriter\n\n\n\n“We’ve been waiting for the right moment for JR Motorsports,” said Earnhardt Jr. in a statement. “With Justin winning the Xfinity Series championship and Chris Stapleton’s undeniable star power, the planets aligned for this perfect opportunity to enter this year’s Daytona 500.”\n\n\n\nTraveller Whiskey reflects Stapleton’s 2015 breakthrough album, Traveller.\n\n\n\n“Traveller Whiskey joining JR Motorsports for their inaugural entry into the Cup Series at the DAYTONA 500 feels like a very natural partnership,” Stapleton said in a statement. “I’m honored to be a part of this historic moment with Dale and Kelley and excited to see Justin race the No. 40 Traveller Whiskey Chevrolet in Daytona.”\n\nChris Stapleton Says Partnership “Feels Very Natural”\n\nStapleton joked with Earnhardt Jr. that he just “obviously wanted to see the car.”\n\n“When I thought about pie-in-the-sky things I want to do to advertise this product we have that I’m real proud of, this was one of those, ‘What if we could do this?’” Stapleton continued.\n\nAfter the race, Earnhardt Jr. and Allgaier were pleased with their No. 9 finish.\n\n\n\n“We showed up for our first race to run in the most elite form of stock car racing,” said Earnhardt Jr. He co-owns JR Motorsports with Kelley Earnhardt Miller and NASCAR Hall of Famer Rick Hendrick. “What kind of expectations can you have in terms of being really competitive in the race? I would say that we’re very happy with a Top-10, really happy that we got to duke it out with them tonight.”\n\n\n\nAllgaier said he thought he and the race team “checked all the boxes.”\n\nChris Stapleton On Partnering With JRM, Song Writing Secrets, and How Long He Plans To Tour\n\n\n\n“I’m really proud of JR Motorsports and everybody on this team,” he said. “We hit all the markers, had pit stops. We had craziness in picking lines. A lot of uncertainty on my part, just knowing the guys you are around. But all in all, it was a solid night.”\n\n\n\nStapleton didn’t publicly comment on the car’s Daytona 500 performance. However, he is approaching some performances of his own. Stapleton announced a host of stadium gigs with George Strait, Parker McCollum, and Little Big Town earlier this month. The run starts May 10 at Lincoln Financial Field in Philadelphia. Other stops include Acrisure Stadium in Pittsburgh, Highmark Stadium in Orchard Park, New York, Gillette Stadium in Foxborough, Massachusetts, and SoFi Stadium in Inglewood, California.\n\n\n\nTickets for the stadium shows go on sale Friday. Visit chrisstapleton.com/tour for more information and sign up for the presale at StapletonFanClub.com.\n\n\n\nFor more information on Traveller Whiskey, visit www.travellerwhiskey.com.\n\n(Photo by John Salangsang/Shutterstock)"
    }
]