[
    {
        "title": "Presidents Are Often Judged By History Through The Lens Of Morality",
        "url": "https://newsone.com/5939034/presidents-are-judged-by-history-through-the-lens-of-morality/",
        "published_date": "2025-02-17T14:33:46+00:00",
        "source_name": "Unknown source",
        "author": "George R. Goethals, University of Richmond",
        "category": "general",
        "content": "A statue of Abraham Lincoln, the 16th president of the United States, sits in the Lincoln Memorial in Washington. Historians consistently have given Lincoln, the Great Emancipator, their highest rating because of his leadership during the Civil War. Jakub Porzycki/NurPhoto via Getty Images\n\nWhat will be former President Joe Biden’s legacy? How will Americans in the future consider his four years in office?\n\nEvery American president lands in the history books. And historians’ assessments of their performance have been generally consistent over time. But some presidents’ rankings have changed as the nation – and historians themselves – reassessed the country’s values and priorities.\n\nHistorians have been ranking presidents in surveys since Arthur Schlesinger Sr.’s first such study appeared in Life magazine in 1948. The results of that survey categorized Presidents Abraham Lincoln, George Washington, Franklin D. Roosevelt, Woodrow Wilson, Thomas Jefferson and Andrew Jackson as “great.”\n\nAt the other end of the ranking, Presidents Ulysses S. Grant and Warren Harding were labeled “failure.”\n\nThere have been numerous surveys ranking presidents since then, including a 1962 survey by Arthur Schlesinger Jr., which showed Jackson dropping into a “near great” category.\n\nChanging views shift rankings\n\nWhile the surveys point to Americans’ evolving social attitudes, with implications for our electoral politics and governance, they don’t always ask historians the same questions. Some simply ask them to rank presidents. Others ask them to also judge specific aspects of leadership, such as economic policy or international diplomacy.\n\nDespite the relative stability of the ratings across surveys – especially at the top, where Lincoln, Washington and Roosevelt consistently hold sway – there have been some dramatic changes. C-SPAN’s four surveys on presidential leadership, for example, show some shifts in historians’ ranking of presidents over time.\n\nSince 2000, the cable network has polled prominent historians every time there has been a change in administrations. So, C-SPAN conducted surveys in 2009, 2017 and 2021 as well. The 2025 survey, which will assess Biden’s presidency, is in the works.\n\nThe surveys offer not only an overall ranking of presidents but also rankings in each of the following 10 categories: public persuasion, crisis leadership, economic management, moral authority, international relations, administrative skills, relations with Congress, vision and agenda setting, pursuance of equal justice for all, and performance within the context of the times.\n\nWhile Lincoln has ranked at the top of each survey, the two presidents who served right before him – Franklin Pierce and James Buchanan, both sympathetic to slavery – and his immediate successor, white supremacist Andrew Johnson, have consistently ranked at the bottom.\n\nDonald Trump debuted in C-SPAN’s 2021 survey near the bottom, ranked 41st of 45 presidents. The rating for his first term, from 2017 to 2021, could change in the 2025 survey; his current presidency will be assessed after he leaves office.\n\nThe Print Collector/Hulton Archive via Getty Images\n\nWhat is a good leader?\n\nAs a social psychologist and leadership scholar at the University of Richmond’s Jepson School of Leadership Studies, with long-standing interests in presidential leadership, I believe these surveys can be best understood in terms of psychologist Dean Keith Simonton’s model of evaluating presidents.\n\nHe maintains that historians generally view leaders, including presidents, positively to the extent that they fit a deeply ingrained image of someone who is strong, active and good. And that image comes to mind when they think of attributes and events linked to a president that suggest he was a good leader. Examples include how long he served, whether he was a war hero and whether he was assassinated, and in that sense, was a martyr.\n\nOn the other hand, historians also easily recall scandals, such as Richard Nixon’s Watergate and Harding’s Teapot Dome. These detract from these presidents’ “good” image, as evidenced by Nixon’s and Harding’s rankings of 31st and 37th, respectively, in C-SPAN’s 2021 survey.\n\nRace matters\n\nIn recent years, presidents’ positions on race and racism have been important factors in historians’ evaluations of their records. For example, Wilson’s rather startling efforts to segregate federal offices and the military are becoming more widely known as scholars explore that aspect of his presidency.\n\nHis actions in that regard may overshadow his international idealism, which favored morality over materialism and has been viewed positively. He is no longer considered one of our “great” presidents. In Schlesinger Sr.’s 1948 survey, he ranked fourth of 29 presidents. But in 2021, historians ranked him 13th of 45 for C-SPAN.\n\nJackson dropped the most in C-SPAN’s surveys, from 13th in 2000 to 22nd in 2021. His commitment to Indian removal from Southern and Midwestern states, not unique for the time, and the resulting Trail of Tears – the forced and violent relocation of Native Americans from their homelands – are important topics in today’s political discussions.\n\nSeveral other presidents who lost ground, including James Polk, Zachary Taylor, Rutherford B. Hayes and Grover Cleveland, were associated with efforts to extend slavery or with failure to protect African Americans following Reconstruction.\n\nThen there is the case of Grant. Ranked at the bottom as a failure in the mid-20th century, he had the largest ranking change of any president in the C-SPAN surveys. He jumped 13 places from 33rd in 2000 to 20th in 2021. He had already moved up from second-to-last place in the 1948 and 1962 Schlesinger surveys to somewhere in the bottom quartile in 2000, to a position in 2021 where more presidents ranked worse than he did.\n\nThe 2021 C-SPAN survey ranks Grant sixth on “pursued equal justice for all,” behind only Lincoln, Lyndon Johnson, Barack Obama, Harry Truman and Jimmy Carter. Given the centrality of equal justice, which may overshadow whatever connection Grant may have had to scandals in his administration, such as Crédit Mobilier and the Whiskey Ring, Grant rises in historians’ overall evaluation.\n\nMoral authority\n\nThis all suggests historians have quite simple ways of evaluating presidents. We have an image of the ideal leader.\n\nPrint Collector/Hulton Archive via Getty Images\n\nJust a few pieces of information relating to that ideal make a big difference in whether we view presidents as fitting or not fitting that image. This is particularly true of our perception of how good they were. Presidents’ moral commitments speak loudly to whether or not we view them as good.\n\nInterestingly, on the quality of “moral authority” in the C-SPAN surveys from 2000 to 2021, Grant’s ranking rose 14 rungs, from 31st to 17th, even more than it did on “pursued equal justice for all,” where it rose 12 rungs, from 18th to sixth. Wilson and Jackson dropped 13 and 18 places, respectively, on “moral authority.”\n\nClearly, moral judgments loom large in historians’ assessments of presidential leadership.\n\nEditor’s note: This story has been updated to reflect the 2025 transfer of power from President Biden to President Trump.\n\nGeorge R. Goethals, Professor in Leadership Studies, University of Richmond\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article."
    },
    {
        "title": "The Prince and Princess of Wales' £33k-per-week Mustique villa has a 60ft pool",
        "url": "https://www.hellomagazine.com/travel/814676/kate-middleton-prince-william-villa-antilles-mustique/",
        "published_date": "2025-02-17T14:33:35+00:00",
        "source_name": "Unknown source",
        "author": "Georgia Brown",
        "category": "general",
        "content": "Error: Page returned status code 404"
    },
    {
        "title": "Scottish museum to undergo 'bold transformation' after £2.6m government funding boost",
        "url": "https://www.scotsman.com/news/scottish-news/scottish-museum-to-undergo-bold-transformation-after-ps26m-government-funding-boost-4994958",
        "published_date": "2025-02-17T14:32:22+00:00",
        "source_name": "Unknown source",
        "author": "Jane Bradley",
        "category": "general",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "The Lathums bring forward release of new album ‘Matter Does Not Define’",
        "url": "https://www.nme.com/news/music/the-lathums-bring-forward-release-of-new-album-matter-does-not-define-3838653?utm_source=rss&utm_medium=rss&utm_campaign=the-lathums-bring-forward-release-of-new-album-matter-does-not-define",
        "published_date": "2025-02-17T14:32:14+00:00",
        "source_name": "Unknown source",
        "author": "Laura Molloy",
        "category": "general",
        "content": "The Lathums have brought forward the release of their new album ‘Matter Does Not Define’.\n\nThe Wigan rock band’s third album was initially due to be released on March 7, but will now come out February 28 after they “pulled a lot of strings”.\n\nAdvertisement\n\nSharing the news on Instagram, they wrote: “MDND IS COMING A WEEK EARLY! ❤️‍🔥 We’ve pulled some (a lot 😅) of strings, and now, our new album will be out Friday 28 February—just over two weeks away. 😎 We couldn’t be more excited for you to hear it.\n\n“Huge thanks to everyone who’s pre-saved & ordered from the store—you’ll be getting the album a whole week sooner! That also means extra time to learn the lyrics before the tour… so no excuses.”\n\nThey gave fans the first taste of their yet-to-be-released third album last summer with the single ‘No Direction’, marking their first new music since the release of their 2023 album ‘From Nothing To A Little Bit More’ – which saw them earn their second Number One LP in the UK album charts – and their standalone single ‘Thoughts Of A Child’ which was shared last October.\n\nFrontman Alex Moore said in a press release that recording the LP “felt like coming full circle”. “We worked on it with our good friend and old college tutor, John Kettle, which brought us back to our roots. The process felt organic, without the pressure to cater to industry demands, and it allowed us to really explore creatively,” he said.\n\nRecommended\n\n“It was like being back in college, free to make music without constraints. Like, [drummer Ryan Durrans] Duz even plays a frying pan in ‘Stellar Cast’, a random touch you might not expect. Album three is real, raw, and everything we hoped it would be.”\n\nShortly after the album’s release, the band will be heading out on a UK and Ireland tour, set to kick off in Glasgow on March 13. From there, they’ll head to Newcastle, Stoke, Sheffield, London, Belfast, Dublin and more. Then, they’ll wrap things up with a hometown gig at Manchester’s O2 Apollo on April 11.\n\nTickets are on sale now and you can get yours here.\n\nThe Lathums’ 2025 UK tour dates are:\n\nMARCH\n\n13 – Barrowland Ballroom, Glasgow\n\n15 – NX Newcastle, Newcastle\n\n17 – Victoria Hall, Stoke\n\n18 – Octagon, Sheffield\n\n20 – Rock City, Nottingham\n\n21 – O2 Academy, Birmingham\n\n22 – O2 Academy Brixton, London\n\n24 – O2 Guildhall, Southhampton\n\n25 – SWX, Bristol\n\n27 – Limelight, Belfast\n\n28 – The Academy, Dublin\n\n\n\nAdvertisement\n\nAPRIL\n\n11 – O2 Apollo, Manchester\n\nThey’re also set to play TRNSMT Festival later this summer, as well as Neighbourhood Weekender.\n\nThe Lathums spoke to NME ahead of the release of their last album ‘From Nothing To A Little Bit More’ last year. Moore said at the time: “What’s the point in putting so much into something that you’re not genuinely passionate about? I think it’s quite refreshing that people can see that there’s genuine feelings behind these songs, not like a lot of music that’s out nowadays that’s got no emotion or substance behind it. You can tell those people are singing about what they think people want [to hear]. But I don’t give you what you want: I give you what you need.”"
    },
    {
        "title": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash",
        "url": "https://www.toledoblade.com/news/nation/2025/02/17/trump-begins-firings-of-faa-air-traffic-control-staff-after-fatal-dc-plane-crash/stories/20250217084",
        "published_date": "2025-02-17T14:31:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Enter-To-Win\nObituaries\nEvents\nJobs\nClassifieds\nMENU\nSUBSCRIBE\nLOGIN\nREGISTER\nLOG OUT\nMY PROFILE\nNEWSLETTERS\nMENU\nACCOUNT\nSubscribe\nLogin\nRegister\nLog out\nMy Profile\nSubscriber Services\nSearch\nSECTIONS\nHOME\nHomepage\nLOCAL\nLocal Home\nAnimals\nCity\nCourts\nCommunity Events\nDaily Log\nDogs for Adoption\nEducation\nEnvironment\nHomicides\nPolice Fire\nPolitics\nSchool Closings\nSuburbs\nTransportation\nNEWS\nNews Home\nDeaths\nMedical\nNation\nReligion\nWorld\nSPORTS\nSports Home\nAmateur\nBGSU\nBrowns\nCavaliers\nCollege\nDana Open\nGolf\nGuardians\nHigh School\nLions\nLourdes\nMichigan\nMud Hens\nOhio State\nOutdoors\nOwens\nPistons\nPro\nRed Wings\nTigers\nUT\nWalleye\nA&E\nA&E Home\nArt\nCulture\nFood\nGardening\nLiving\nMovies\nMusic, Theater, & Dance\nPeach Weekender\nRestaurant Reviews\nToledo Magazine\nTV & Radio\nBUSINESS\nBusiness Home\nAgriculture\nAutomotive\nDevelopment\nEnergy\nLabor\nPersonal Finance\nReal Estate\nRestaurant\nRetail\nStock Market\nTechnology\nOPINION\nOpinion Home\nColumnists\nEditorial Cartoons\nEditorials\nKeith Burris\nLetters to the Editor\nSubmit a Letter\nHEALTH & WELL-BEING\nHealth & Well-Being Home\nB PARTNERS\nB Partners Home\nAbility Center\nArrowhead Behavioral\nBalance & Mobility\nBGSU\nBlack Diamond\nBlue Ribbon Hemp\nBolt Express\nBoyk Law Offices\nCASA\nEpworth Church\nExciting Windows by Couture\nFair Housing Center\nFinixio\nFulton Cty Health Center\nGlass City Academy\nGTCF\nHammill Medical\nHoliday Gift Guide\nHomes\nHOPE Toledo\nHylant\nImagination Station\nJustCBD\nKapios\nKeystone\nKids of Character\nLa-Z-Boy\nLeadership Toledo\nLevis Commons\nLourdes University\nLucas County Recorder\nLuther Home of Mercy\nMcLaren St. Luke's\nMed1Care\nMighty Earth\nMinistry of Hemp\nMission Lean\nMVCDS\nOhioans Home Healthcare\nOSU Engineering\nOswald Companies\nPhoenix Investors\nProMedica\nProMedica Medical Mgmt\nReaders' Choice Awards\nRestaurants\nRonald McDonald House\nShumaker\nSolheim Cup\nSpengler Nathanson\nTARTA\nTernion\nToledo Clinic\nToledo Museum of Art\nToledo Public Library\nUnited Way\nUniversity of Toledo\nUT Physicians\nUTMC\nUSA Insulation\nZenobia Shriners\nMEALS WITH MADDIE\nMeals with Maddie Home\nOTHER\nEBLADE\nENTER-TO-WIN\nBLADE REWARDS\nBLADE VAULT / REPRINTS\nCLASSIFIEDS\nOBITUARIES\nJOBS\nCLASSIFIEDS\nBLADE HOMES\nHOMES\nWEEKLY ADS\nEVENTS\nCONTACT US / FAQ\nCONTACT US\nSUBSCRIBER GUIDE\nADVERTISING\nCAREER OPPORTUNITIES\n&nbsp\n&nbsp\nTOP"
    },
    {
        "title": "“Time will come”: Carlos Alcaraz Opens Up About the Surprising Reason He’s Grown Apart from His Idol Rafael Nadal",
        "url": "https://www.essentiallysports.com/atp-tennis-news-time-will-come-carlos-alcaraz-opens-up-about-the-surprising-reason-hes-grown-apart-from-his-idol-rafael-nadal/",
        "published_date": "2025-02-17T14:31:17+00:00",
        "source_name": "Unknown source",
        "author": "Aarav Singh Gill",
        "category": "sports",
        "content": "It’s never easy to bid farewell to your childhood idol. When Carlos Alcaraz emotionally thanked Spanish legend Rafael Nadal “for being an inspiration to all of us,” tears rolled the inner him just to see the 22-time Slam winner drift apart from the sport he gave everything to for nearly two decades. The ‘King of Clay’ played the final match of his illustrious career representing Spain at the Davis Cup Final 8 in Malaga in November last year. However, since his departure, Alcaraz hasn’t been in contact with him. The reason?\n\nHaving dedicated his life on the court and following a hectic tour-level calendar, naturally, left little to no personal time for Rafa. But, his retirement meant he could now finally reap the rewards of his years-long hard work and, Alcaraz respected that. During a conversation with the Spanish publication, ‘Sport’, the 21-year-old spoke about his dynamic with the former World No. 1 and acknowledged the well-deserved break relished by Nadal, before commencing his Qatar Open campaign.\n\n“Rafa and I have a very good relationship, but I haven’t spoken to him again since he retired from the Davis Cup. I think he deserves to be at peace with his family and enjoying the things that he couldn’t enjoy when he was playing,” he said. “He has been and is a great role model for me. I have seen that he has congratulated me on social media, but I have not yet had the chance to speak to him. I am sure that the time will come when I can do so.”\n\nADVERTISEMENT Article continues below this ad\n\nThe former World No. 1, marred with injury concerns ever since sustaining a hip injury at the 2022 Australian Open, struggled to restore his A-game on the tour. Moreover, his valiant effort to clinch a final gold medal for his nation at the Paris Olympics in 2024 also came crashing after he suffered a premature exit at the quadrennial event.\n\nBefore Nadal drew the curtain on his career in front of his home crowd in Malaga, Alcaraz hoped to bid him farewell in the most fitting way. “No player deserves more to finish the incredible career he had with a title, and I know how special the Davis Cup is for him. It will be a difficult challenge but winning it for Rafa is a huge motivation.” Life post-retirement has been full of business commitments for Rafa.\n\nJust days ago, reports showed fans that the Spanish icon sold nearly half his stake (44.9%) in his ‘Rafa Nadal Academy’ to a private investment company GPF for a lucrative $100M profit. Moreover, Nadal hasn’t appeared as a spectator at any tennis events since retirement. As for Alcaraz, the 21-year-old has his sights set on the big task.\n\nADVERTISEMENT Article continues below this ad\n\nCarlos Alcaraz on climbing the ATP ranking ladder – “Number one is always a goal”\n\nDoors to claiming the World No. 1 spot were just opened for players. And, that’s an opportunity Spanish superstar Carlos Alcaraz won’t sleep on. The ATP ranking leader, Jannik Sinner, recently accepted a three-month doping suspension from the tour after coming to an agreement with WADA to seal his long-drawn doping controversy.\n\nThe Italian sensation twice tested positive for a banned substance in March last year, drawing acute backlash from the community. However, his absence means that arch-rival Alcaraz can regain his lost spot.\n\nADVERTISEMENT Article continues below this ad\n\nTalking in the same interview, Alcaraz, although refrained from talking about Sinner’s doping saga – “The truth is little to say. Whether it is or not, it does not influence us. We remain focused on ours and our goals” – talked about reclaiming the World No. 1 spot. “The number one is always a goal. As I say, that it’s not there doesn’t change anything for us. We try to improve in our own and focus on continuing to work to reach number one.”\n\nAlcaraz will next take to the court on Monday, February 17. The top-seeded player is slated to lock horns with Marin Cilic in the Middle Eastern event’s Round of 32."
    },
    {
        "title": "Patriots predicted to swing blockbuster trade for $94 million Steelers star",
        "url": "https://www.sportingnews.com/us/nfl/new-england-patriots/news/patriots-predicted-swing-blockbuster-trade-94-million-steelers-star-george-pickens/f5e243658f1487cb957d7620",
        "published_date": "2025-02-17T14:31:16+00:00",
        "source_name": "Unknown source",
        "author": "Aaliyan Mohammed",
        "category": "sports",
        "content": "The New England Patriots will prioritize finding weapons for Drake Maye this offseason. They could land a young star through a trade with an AFC North team.\n\nThe Pittsburgh Steelers will have to decide who their quarterback is going forward and the uncertainty could lead to George Pickens wanting a change of scenery. Pickens has 2,841 yards and 12 touchdowns in three seasons with the Steelers. He has been vocal about targets and could be a trade candidate this offseason. Sportsnaut's Andrew Buller-Russ predicted the Patriots would trade for Pickens this offseason.\n\n\"The Patriots have a couple of young receivers in development, but Drake Maye is ready to produce now,\" wrote Buller-Russ. \"Meanwhile, the Steelers have had some internal issues with George Pickens and now he’s eligible for an extension. Pittsburgh could prefer to capitalize on Pickens’ trade value and New England would probably appreciate adding a target who can be a bonafide WR1.\"\n\nMike Vrabel has shown the ability to deal with an outspoken receiver in the past. He coached A.J. Brown for three seasons on the Titans. Pickens is projected to earn a four-year, $94 million deal as a free agent. He is in the final year of his rookie deal and could be a great addition for Maye in New England.\n\nHe already has a 1,000-yard season under his belt and had 900 yards last season despite missing three games and inconsistent quarterback play.\n\nMore NFL: Patriots, Eagles blockbuster trade proposal would bring $96 million superstar to NE"
    },
    {
        "title": "Diktaean Cave Still Closed: Accessibility Upgrades and Delays Explained",
        "url": "https://www.argophilia.com/news/diktaean-cave-still-closed/240400/",
        "published_date": "2025-02-17T14:30:41+00:00",
        "source_name": "Unknown source",
        "author": "Manuel Santos",
        "category": "general",
        "content": "The Diktaean Cave, a significant tourist site in Crete, remains inaccessible.\n\nPlans to add a lift, improve infrastructure, and update facilities are in motion.\n\nAccessibility for disabled visitors is a primary focus, but progress is slow.\n\nThe large-scale project includes trail restoration, parking changes, and enhanced visitor experiences.\n\nDespite approvals and funding, no completion date is set.\n\nAs we announced in 2024, the Diktaean Cave is closed to the public and will remain inaccessible in the summer of 2025. Officials assure everyone that the wheels are turning, but if this pace gets any slower, they may need an archaeological dig themselves to find the completed project.\n\nPlan of the redevelopment of Europe Square (Photo: Ministry of Culture ΥΠΠΟ)\n\nΕπιτάχυνση διαδικασιών για την κατασκευή του αναβατορίου και την αναβάθμιση των υποδομών στο Δικταίο Άντρο\n\nA Much-Needed Overhaul\n\nThe cave, steeped in mythology as the birthplace of Zeus (yes, that Zeus), has long drawn in crowds—but for many, reaching it is an uphill battle. The plan—a million-euro blockbuster of a project—is ambitious. The project is financed by the Ministry of Culture with approximately 16,000,000 euros from the Recovery Fund. Highlights include:\n\nInstallation of a hillside lift from Europe Square up to the cave entrance, making it accessible for mobility-impaired visitors.\n\nfrom Europe Square up to the cave entrance, making it accessible for mobility-impaired visitors. Reinforcement of rocky slopes inside the cave for safety.\n\ninside the cave for safety. Upgraded lighting for better visibility, or perhaps so you can glare at your guide when they tell you it’s still “under construction.”\n\nfor better visibility, or perhaps so you can glare at your guide when they tell you it’s still “under construction.” Revamping Europe Square , complete with new paths, sitting areas, and fewer potholes disguised as “character.”\n\n, complete with new paths, sitting areas, and fewer potholes disguised as “character.” Restoration of stone trails leading to and from the cave because visitors really don’t dream of twisting an ankle.\n\nleading to and from the cave because visitors really don’t dream of twisting an ankle. New parking arrangements, finally moving spaces away from the footpaths they currently dominate.\n\nView of the Diktaion Andros slope lift at the starting point (Photo: Ministry of Culture ΥΠΠΟ)\n\nIf there’s anything Greece loves more than backed-up construction timelines, it’s more studies and permits. The Central Archaeological Council has waved through the plans, while Development Organization “Daedalos SA” is handling the heavy lifting (figuratively—for now). The Ministry of Culture threw €16 million from recovery fund money into the works. However, the cave is still… well, very closed.\n\nMythology Meets Red Tape\n\nBack in September 2024, Greece’s Culture Minister, Lina Mendoni, took the mic to remind everyone of the cave’s rich heritage and, naturally, to address the why-is-this-taking-so-long crowd. “This is a globally significant site tied to legends of Zeus and Europe’s sneaky seduction under a plane tree.” Sounds lovely, doesn’t it? Except for one little snag: the area is practically impossible to reach for anyone not in peak physical condition or those requiring specialized access.\n\nMendoni waxed poetic about the cave’s potential after the upgrades—calling it an “irreplaceable cultural asset” once the lift is installed. Until then, let’s be honest: it’s just eye sore standing behind no-entry tape.\n\nHere’s what’s promised when the changes are completed:\n\nImproved accessibility for all, in line with a “universal access” initiative.\n\nConservation work to return the cave to its former Neolithic-era glory.\n\nA safer, modernized space offering a comfortable journey to explore its historical depth (finally).\n\nFor now, though, visitors can look forward to hiking busted trails while squinting at posted signs stating, “renovations in progress.”"
    },
    {
        "title": "TNA Impact preview: The lineup for Thursday’s live show (Full Sail reports needed)",
        "url": "https://prowrestling.net/site/2025/02/17/tna-impact-preview-the-lineup-for-thursdays-live-show-full-sail-reports-needed-2/",
        "published_date": "2025-02-17T14:30:40+00:00",
        "source_name": "Unknown source",
        "author": "Jason Powell",
        "category": "general",
        "content": "CategoriesImpact News\n\nBy Jason Powell, ProWrestling.net Editor (@prowrestlingnet)\n\nTNA is advertising the following matches and events for Thursday’s TNA Impact television show.\n\n-TNA World Champion Joe Hendry in concert\n\n-“The Rascalz” Trey Miguel and Zachary Wentz vs. Tyson Dupont and Tyriek Igwe\n\n-JDC vs. Leon Slater in a No DQ match\n\n-Tessa Blanchard ordered to wrestle by Santino Marella\n\nPowell’s POV: Impact will be live on Thursday from Orlando, Florida at Full Sail University. The company will also tape future television shows on Friday. We are looking for reports or basic results via dotnetjason@gmail.com.\n\nTNA Impact is simulcast Thursdays on AXS TV and TNA+ at 7CT/8ET. John Moore’s weekly TNA Impact reviews are typically available on Fridays, along with my audio reviews for Dot Net Members (including our Patreon patrons), but we may have live coverage due to this show airing live."
    },
    {
        "title": "Why doesn’t Grant Hill get the Tom Brady treatment over conflicts of interest?",
        "url": "https://awfulannouncing.com/nba/grant-hill-tom-brady-conflicts-of-interest.html",
        "published_date": "2025-02-17T14:30:38+00:00",
        "source_name": "Unknown source",
        "author": "Brendon Kleen",
        "category": "general",
        "content": "Credit: TNT, Fox. Edit by Liam McGuire, Comeback Media.\n\nIt always felt like a cruel joke that Shaquille O’Neal was a part-owner of the Sacramento Kings. The transaction literalized what was true for all of O’Neal’s time in Los Angeles. His Lakers teams owned the Kings, but O’Neal purchasing an actual stake was just a twist of the knife.\n\nIn 2022, O’Neal sold his stake in the Kings after nine years as a limited partner alongside team governor Vivek Ranadive. Ever a savvy businessman, O’Neal cashed in on new NBA rules allowing venture capital firms to buy into teams. The Hall of Famer was also selling high, just like Mark Cuban and several other owners did in the late 2010s and early 2020s.\n\nAll of that may have helped convince O’Neal to move on from his Shaq-ramento era, but the real reason O’Neal sold was to strike a deal with WynnBett. Per league rules, O’Neal could not partner with a sports gambling operator as an active owner.\n\nIt should be no surprise that team officials are banned from betting deals. The more intriguing element of O’Neal’s career during this period is not the part-time gig he sacrificed for that sportsbook bag but the one he was allowed to keep.\n\nO’Neal bought into the Kings two years after he joined Inside the NBA and worked as a panelist on the show for the duration of his tenure as Sacramento part-owner. At a time when Tom Brady’s investment in the Las Vegas Raiders is held up as a conflict of interest for the retired QB who splits time as a game analyst at Fox, O’Neal got carte blanche from his bosses at TNT for nearly a decade in a similar situation.\n\nThat brings us to Grant Hill. The No. 3 analyst for TNT is a busy man. Hill will call his 11th NCAA tournament this spring alongside Bill Raftery. Away from the mics, Hill is also the managing director of the U.S. men’s national basketball team — and, since 2015, a part-owner of the Atlanta Hawks.\n\nTo show just how impactful Hill is across basketball, he joined Puck’s The Varsity podcast this weekend, and the conversation hardly touched on his media career. But in addition to calling games for both TNT and CBS, Hill is also reportedly a candidate to join ESPN’s roster next season when TNT loses its NBA rights. Depending on when the NBA media carousel stops spinning, Hill could even end up on ESPN’s top team.\n\nSo, what’s the difference between Hill and Brady? At face value, not much. Sure, Hill isn’t calling the Super Bowl like Brady just did in his first season at Fox. And Hill is not nearly as famous as Brady. Hill said on The Varsity that he does not carry much responsibility in Atlanta, but Brady would likely say the same.\n\nHill does have sway at USA Basketball, where he works alongside the sport’s biggest stars from the junior circuit to the Olympics. We could very easily watch Hill call the Final Four this spring, getting access to the best young players in the world in production meetings. No. 3-ranked Duke has a trio of freshmen expected to be drafted in the top 10 of the NBA Draft, led by Cooper Flagg. Setting aside that Hill is also a fellow Dukie, he would have tremendous access to these players in weekly production meetings. Of course, those relationships will help during the NBA Draft or free agency when Hill is helping Atlanta recruit players or during the selection process for the 2027 FIBA World Cup or 2028 Olympics.\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\nWorking as a broadcaster helps Hill as an owner and Team USA executive the same way it helped Brady being around Detroit’s Ben Johnson in the lead-up to the NFC divisional round. In fact, Hill might even have a greater advantage given that (as far as we know) he is not subject to the same league-enforced restrictions as Brady.\n\nBrady’s defenders throughout the season argued that these conflicts of interest were overblown. The upper hand he might get in one role due to having the other wasn’t enough of an issue for Fox executives to hesitate in hiring him or for the NFL and its owners to vote to deny his ownership stake. The most cynical would argue that these conflicts are prevalent across media, and everyone has an angle. Maybe!\n\nHowever, everyone from Fox leadership to the NFL commissioner appeared to be pretty triggered by the idea that he was compromised. Across media, it spurred a debate. Even Dale Earnhardt Jr. caught some strays. The debate was punctuated by NFL reporter Mike Florio, who insisted his bosses at NBC would never sign up for such an arrangement.\n\nYet, between TNT and ESPN, we know of two basketball broadcasters who appear to be fine with Hill’s conflicts. Fox isn’t firing Brady. Earnhardt is a budding media star.\n\nThe media has agreed that this is a real issue, something that Brady and Fox have to address and that networks should ideally try to avoid. So why has Hill skirted it, like O’Neal before him?\n\nTo my eye, they have done so for the same reason Brady has: Their teams suck.\n\nWhen Brady’s predecessor at Fox, Troy Aikman, recently defended Brady on a podcast, he claimed that when he asked Fox Sports permission to join a group bidding on an NFL team, the company had one reservation. Since this was before the legalization of sports betting, Fox didn’t address the conflict O’Neal sold to avoid. Instead, it was this: If the team Aikman owned ever made the Super Bowl, he would likely not be allowed to call it.\n\nAikman meant this story to defend Fox and Brady, but it also revealed the line in the sand. Perhaps it’s not about Brady or Hill having a conflict of interest, but where it lies. It would matter more if Brady owned the Eagles or Hill owned the Celtics.\n\nThey are allowed to tinker around as part-owners of irrelevant franchises. When O’Neal owned the Kings, how often was Sacramento really coming up on Inside the NBA? It wasn’t a factor. But if Brady or Hill can pull off a miracle and bring the Raiders or Hawks back from the dead, perhaps management will come knocking.\n\nUntil then, they are very influential people who happen to call games for major networks, taking advantage of the platform and access that comes with it."
    },
    {
        "title": "Air Force One: 12 Amazing Facts And Features Of The Presidential Aircraft",
        "url": "https://www.slashgear.com/1783116/air-force-one-facts-features-amazing-presidential-aircraft-vc-25/",
        "published_date": "2025-02-17T14:30:34+00:00",
        "source_name": "Unknown source",
        "author": "staff@slashgear.com (Michael Bruton)",
        "category": "general",
        "content": "Upon the founding of the United States, Americans had a lot to figure out about the office of the President. The Capitol, now called D.C., was a rural backwater, and America didn't even have a dedicated Presidential mansion until John Adams took over for first President George Washington in 1800.\n\nAdvertisement\n\nAs time and technology progressed, America's global influence grew. The era of steam faded, ocean liners rose and fell. Cars replaced horses, and the advent of flight revolutionized the President's travel options, opening up new and improved ways to traverse the world. Coupled with America's rising status as a superpower, a mobile president needed to embrace travel. An aircraft dedicated to the office of the President didn't happen until the Truman Administration of the late 1940s. Since then, the mission has grown along with America's global presence.\n\nWhether ferrying the president of the United States on good will and diplomatic missions, such as the historic trip to China by President Richard Nixon in 1972, or serving as a mobile command center in times of crisis, like the 9/11 attacks, Air Force One has become a symbol of American's global capability.\n\nAdvertisement\n\nIn honor of one of the most famous aircraft of all time, we dive into the fantastic facts and features surrounding the president's air travel on Air Force One."
    },
    {
        "title": "AI Predicts UFC vs. Boxing Super Fights Apart From Alex Pereira vs Oleksandr Usyk",
        "url": "https://www.essentiallysports.com/ufc-mma-boxing-news-ai-predicts-ufc-vs-boxing-super-fights-apart-from-alex-pereira-vs-oleksandr-usyk/",
        "published_date": "2025-02-17T14:30:24+00:00",
        "source_name": "Unknown source",
        "author": "Abhishek Kumar Das",
        "category": "sports",
        "content": "Oleksandr Usyk, a boxing superstar and multiple world champion, is preparing for his retirement. Surprisingly, UFC champion Alex Pereira seems to be involved in his final plans. In a recent interview with ‘TNT Sports,’ the Ukrainian boxer confirmed the news originally published by ‘Sky Sports’ that he plans to fight only two more times before retiring. However, when asked which opponents he would choose to face in his final two fights, Usyk named Alex Pereira as one of his top picks. He said, “First is, who wins the next [Dubois or Parker] fight on February 22? Next maybe a ‘show fight’ with Alex Pereira. Maybe. Why not? Alex wants to.”\n\nThis news had the fight world buzzing, and many fans cannot wait to see if the two legends of the sport trade blows inside the ring. However, if this super fight materializes, it would be that the two major sports can and will witness more such events. So, what other UFC vs. boxing fights can we get to see in 2025? Well, we took the help of AI to find out the answer to who will fight next, and how the dream match will play out. So, without further ado, let’s find out!\n\nSean O’Malley vs. Gervonta Davis (Boxing Only)\n\nADVERTISEMENT Article continues below this ad\n\nSean O’Malley has often shown an interest in boxing, but facing Gervonta Davis would be a nightmare for the UFC Bantamweight Champion. In MMA, O’Malley strikes with precision and has outstanding range control, creative angles, and knockout power. However, boxing is a different discipline, and against an elite technician like Davis, those advantages would be gone in a minute. As per AI, Gervonta Davis will win this bout, purely based on significant differences in footwork, defensive movement, and overall boxing IQ.\n\nvia Imago Credits: Imago\n\nWhile O’Malley’s reach and awkward technique may help him stay competitive in the early rounds, Davis’ ability to analyze opponents, cut off the ring, and react with devastating accuracy may finally overwhelm him. The sheer difference in experience—Gervonta Davis being a lifetime boxer and ‘Sugar’ transitioning from MMA—would be too great to overcome. After gradually breaking down the UFC fighter, AI predicts Davis will win by knockout, most likely in the middle to late rounds.\n\nFrancis Ngannou vs. Deontay Wilder (Boxing & MMA—Two-Fight Deal)\n\nFrancis Ngannou vs. Deontay Wilder, a long-rumored dream matchup, would be one of the most interesting cross-sport battles in combat sports history. Seeing how Ngannou has revealed his intention to fight him, combat fans might get the duo trading blows in 2025. But how will it play out? With both fighters having devastating knockout power, the outcome would be dependent on whether they fought in a boxing ring or an MMA cage.\n\nIn boxing, AI predicts Wilder will surely have a decisive advantage. Despite Ngannou’s unexpected performance against Tyson Fury, Wilder’s experience, speed, and technical perfection would make a significant difference. The former UFC heavyweight’s raw power is always a threat, but Deontay Wilder’s ability to hit a knockout shot from any angle will most certainly secure him a victory.\n\nView this post on Instagram A post shared by MMA ADDICT (@mmaaddictonly)\n\nSo, AI predicts Wilder wins via knockout, probably in the early rounds, before Ngannou can make any adjustments. However, if the fight was held under MMA regulations, the tables would change dramatically. ‘The Predator,’ with his improved grappling skills and ability to impose his physicality, would crush Wilder in a cage. As per AI, Ngannou is going to use clinch work, wrestling, or simply his superior skill to fight in close quarters to finish Wilder early. Whether through takedowns or dirty boxing, Ngannou would dominate within a round, illustrating the vast contrast between an MMA fighter and a pure boxer when the rules are modified.\n\nJon Jones vs. Tyson Fury (Boxing & Hybrid Rules Possibility)\n\nADVERTISEMENT Article continues below this ad\n\nJon Jones and Tyson Fury have been talking about fighting for years, but the rules of the match would decide everything. If it were a boxing match, AI would greatly prefer Fury. His stature, defensive abilities, and range control would make for an easy night. The reigning UFC heavyweight champion may have awkward striking that causes uncertainty early on, but Tyson Fury’s expertise in facing world-class heavyweights will allow him to adjust quickly. As a result, AI believes that Fury will win by unanimous decision or late stoppage.\n\nADVERTISEMENT Article continues below this ad\n\nHowever, the idea of a hybrid rules fight has the potential to completely transform the scenario. Given Saudi Arabia’s rising interest in combat sports, a fight with modified rules—such as boxing with MMA gloves or permitting clinch work—could happen.\n\nIf clinching, elbows, and even some grappling were permitted, Jones’ versatility could provide him with a real opportunity. So, AI predicts that in a hybrid bout in which Fury’s ability to tie up and delay is limited, ‘Bones’ could tire him down and pull off an upset. However, in traditional boxing, Tyson Fury remains the obvious favorite. But what do you think? Do you agree with the predictions? Which other fight apart from Alex Pereira and Oleksandr Usyk do you see happening? Let us know in the comments."
    },
    {
        "title": "These States Have the Highest Foreclosure Rates Going Into 2025",
        "url": "https://247wallst.com/economy/2025/02/17/these-states-have-the-highest-foreclosure-rates-going-into-2025/",
        "published_date": "2025-02-17T14:30:13+00:00",
        "source_name": "Unknown source",
        "author": "Aaron Webber",
        "category": "general",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "2025 NFL Draft Scouting Report: Missouri WR Theo Wease Jr.",
        "url": "https://steelersdepot.com/2025/02/2025-nfl-draft-scouting-report-missouri-wr-theo-wease-jr/",
        "published_date": "2025-02-17T14:30:13+00:00",
        "source_name": "Unknown source",
        "author": "Alex Kozora",
        "category": "general",
        "content": "From now until the 2025 NFL Draft, we will scout and create profiles for as many prospects as possible, examining their strengths, weaknesses, and what they can bring to an NFL franchise. These players could be potential top 10 picks, down to Day 3 selections, and priority undrafted free agents. Today, a scouting report on Missouri WR Theo Wease Jr.\n\n#1 Theo Wease Jr./WR Missouri – 6022, 202 pounds (Grad Student)\n\nMeasurements\n\nPlayer Ht/Wt Hand Size Arm Length Wingspan Theo Wease Jr. 6022/202 8 1/2 32 1/4 77 7/8 40-Yard Dash 10-Yard Dash Short Shuttle 3-Cone N/A N/A N/A N/A Broad Jump Vertical Bench Press N/A N/A N/A\n\nTHE GOOD\n\n– Big frame and good bulk, broad shoulders and muscular build\n\n– Has comfortable stance with proper bend\n\n– Consistent YAC threat, able to break tackles and create after the catch\n\n– Able to turn short passes into big plays\n\n– Shows burst to get away from defenders on slants\n\n– Flashes of nuanced downfield route running with head fakes to turn around defensive backs\n\n– Speed looks above average\n\n– Frame and length offer blocking profile, shows effort and willingness to be effective, sticking on stalk blocks in run game\n\n– Ran routes to all levels\n\n– Fairly productive despite being No. 2 WR with rocky quarterback play and plenty of overall experience\n\nThe Bad\n\n– Small hands, especially for frame\n\n– Doesn’t always play to size, want to see him be more physical off the line and with ball in the air\n\n– Gets beat up too much by press coverage and physical defensive backs\n\n– Struggles to consistently track the ball on vertical throws, loses on more jump balls than he should\n\n– Average separator who doesn’t consistently break away from defensive backs, especially downfield\n\n– Needs to consistently show nuance in route running\n\n– Can work harder in scramble drills to get in QB’s line of vision\n\n– Tendency to run east/west around the sticks\n\n– Older prospect who spent six years in college\n\nBio\n\n– Turns 24 in June 2025\n\n– Appeared in 63 games and two-year starter for Tigers\n\n– Spent 2019-2022 with Oklahoma, transferred to Missouri for 2023-2024\n\n– Career: 173 receptions, 2,610 yards (15.1 YPC) 20 TDs,\n\n– 2024: 60 receptions, 884 yards (14.7 YPC) 4 TDs; one fewer catch than teammate Luther Burden III and had more yards\n\n– Named 2024 team captain\n\n– Had 64 catches for 1,044 yards (16.3 YPC) and 10 TDs at Oklahoma, catching two touchdown passes as a freshman from Jalen Hurts while working with Spencer Rattler in 2021\n\n– Three drops in two years with Missouri\n\n– Five-star recruit from Allen, Texas, No. 2 player in state behind DeMarvin Leal; chose Oklahoma over Alabama, Georgia, Michigan, USC, and countless other major programs\n\n– Had over 1,000 yards and 18 total touchdowns (16 receiving, two kick returns) senior year of HS\n\n– Part of Peer Assistance and Leadership (PAL) program from eighth grade through high school\n\n– Broke his foot early in fall of 2021 and only appeared in two games (initially hurt foot in spring of 2021 that put him in a cast)\n\n– Initially entered transfer portal in 2021 before returning to Oklahoma, left the following year for Missouri\n\n– Arrested in August 2024 for failure to appear in court stemming from February ticket for failing to wear a seatbelt; released on $10 bond\n\n– Named in court documents as witness in relation to 2021 robbery by several Oklahoma teammates; was not implicated in the crime and wasn’t charged\n\n– Had minor arm injury in September 2024 that didn’t cause him to miss time; missed second half of 2024 bowl game after suffering upper-body injury from hard hit\n\nTape Breakdown\n\nTheo Wease Jr. was an elite recruit out of high school, joining Oklahoma before finishing his career at Missouri for his final two years. Joining the Tigers partly due to a friendship with WR Luther Burden III, Wease was overshadowed by him at Missouri despite posting similar production in 2024.\n\nWease’s best moments come in run after. He has the size and bulk to break tackles and enough speed to do damage. His YAC is impressive and the bulk of his biggest moments.\n\nThere are moments of Wease being a nuanced and bursty route runner, especially underneath in the three-step game. He needs to show it more often vertically but in select plays, he can display that, too. Watch the head nod here at the bottom of the screen to get the cornerback to open to the sideline as Wease breaks his route to the post.\n\nHe’s a good-effort blocker with size, strength, and length. It makes him effective in the run game.\n\nDespite his size, Wease isn’t as strong a deep-ball/contested-catch player as you’d expect. He had moments, including a big score against Oklahoma while at Missouri, but he struggles to track and finish. His quarterback play in 2024 was poor, no question, but he still missed out on opportunities.\n\nAthletically, he’s average to perhaps slightly above but it’s nothing remarkable in his toolbelt. He’s far removed from those foot injuries but two in 2021 will need to be checked out and hopefully aren’t a long-term problem.\n\nConclusion\n\nOverall, Theo Wease is the other Missouri receiver in this year’s draft. He doesn’t play as big and physical as his frame suggests without the ball in his hand but is effective post-catch. He profiles as a Z-type receiver who can work in the three/five-step game on screens, slants, and plays between the hashes. There’s not a lot here but there’s a little to put him on the draft fringe. My NFL comp is former New Orleans Saints WR Tre’Quan Smith, who broke 15 tackles on just 131 receptions throughout his career.\n\nProjection: Late Day 3-Undrafted\n\nDepot Draft Grade: 6.2MED – Sixth/Seventh Round (End Of Roster/Practice Squad)\n\nGames Watched: at Texas A&M (2024), vs Boston College (2024), at South Carolina (2024), TD cut-up"
    },
    {
        "title": "How to delete all your photos on Facebook",
        "url": "https://www.trustedreviews.com/how-to/delete-all-your-photos-on-facebook-4230891",
        "published_date": "2025-02-17T14:29:29+00:00",
        "source_name": "Unknown source",
        "author": "Hannah Davies",
        "category": "general",
        "content": "Embarrassed by your old Facebook photos and want a quick and easy way to delete them from your profile? We’ve all been there, so we’ve put together this quick and easy guide.\n\nWhile it isn’t possible to delete all your photos in one go, there are ways to delete groups of pictures at once to help reduce the time it takes.\n\nDoing a complete Facebook overhaul? Visit our guide on how to change your email address and how to make your profile private on Facebook too.\n\nOtherwise, keep reading to learn how to delete all your photos on Facebook.\n\nWhat you’ll need:\n\nA Facebook account\n\nAccess to a web or mobile browser or the Facebook iOS or Android app\n\nThe short version:\n\nOpen your Facebook profile\n\nClick on your name in the top right corner\n\nClick Photos\n\nClick Albums\n\nClick the three dots next to an album\n\nClick Delete Album and repeat\n\nStep\n\n1 Open your Facebook profile We’ll demonstrate the steps using a web browser, however the steps are the same with a mobile browser or via the Facebook app.\n\nStep\n\n2 Click on your name in the top right corner Next to your profile picture, you’ll see your name. Just note that if your browser window is minimised, or you’re using a mobile, then you may only see your profile picture and not your name. Regardless, clicking here will take you to your profile. Step\n\n3 Click Photos On the top panel, underneath your cover photo and name, click on the Photos button. Step\n\n4 Click Albums The fastest way to delete all of your photos is to remove them by album. You can delete individual photos if you’d prefer, however this is a much more lengthy process. Step\n\n5 Click the three dots next to an album You’ll see the three dots icon in the top right corner of each album. Step\n\n6 Click Delete album and repeat Select Delete album and this will be done instantly. To delete all your photos, simply repeat steps five and six until your albums are gone.\n\n\n\nRemember, you can’t get these albums back once they’ve been deleted.\n\n"
    },
    {
        "title": "I-84 closures from Pendleton to Baker City",
        "url": "https://www.kivitv.com/news/local-news/in-your-neighborhood/i-84-closures-from-pendleton-to-baker-city",
        "published_date": "2025-02-17T14:29:26+00:00",
        "source_name": "Unknown source",
        "author": "Danny Flynn",
        "category": "general",
        "content": "NewsLocal NewsIn Your Neighborhood\nActions\nFacebook\nTweet\nEmail\nI-84 closures from Pendleton to Baker City\nDue to multiple disabled vehicles\nPrev Next\nODOT\nEastbound I-84 closed from Pendleton to La Grand\nBy: Danny Flynn\nPosted\nOREGON — Closures this morning along a lengthy stretch of I-84 from Pendleton to Baker City due to multiple disabled vehicles.\nEast and Westbound lanes from Pendleton to La Grand are closed right now and westbound I-84 is closed from La Grand to Baker City.\nAvoid the area if you can, but if you need to make the drive, expect delays.\nYou can check the very latest on Oregon road conditions here.\nCopyright 2025 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nSign up for the Headlines Newsletter and receive up to date information.\nnow signed up to receive the Headlines Newsletter.\nClick here to manage all Newsletters\nBoise 6 / Twin Falls 6, your new home for the Vegas Golden Knights"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 6 of 6]",
        "url": "https://www.dvidshub.net/image/8873844/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:23+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Content Credentials Issued by: on VIRIN: Date Created: City: State: Country:\n\nFrom left, Mr. Norman Chipakupaku, permanent secretary of the Ministry of Defence of the Republic of Zambia, and U.S. Air Force Gen. James Hecker, U.S. Air Forces in Europe - Air Forces Africa commander, participate in the opening ceremony for the 14th African Air Chiefs Symposium in Lusaka, Zambia, Feb. 17, 2025. The opening ceremony set the stage for vital discussions on strengthening multinational collaboration, and enhancing security cooperation among African nations. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 1 of 6]",
        "url": "https://www.dvidshub.net/image/8873839/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Content Credentials Issued by: on VIRIN: Date Created: City: State: Country:\n\nAir chiefs and government officials from the Republic of Zambia as well as the U.S. Air Forces in Europe - Air Forces Africa command team attend the 14th African Air Chiefs symposium at Lusaka, Zambia. AACS aimed to strengthen regional partnerships, provide opportunities to assess capabilities and identify gaps to build further engagements between the U.S. and our African partners. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 2 of 6]",
        "url": "https://www.dvidshub.net/image/8873840/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Content Credentials Issued by: on VIRIN: Date Created: City: State: Country:\n\nU.S. Air Force Gen. James Hecker, U.S. Air Forces in Europe - Air Forces Africa commander meets with Zambian Air Force Lt. Gen. Oscar Nyoni, Zambian Air Force commander, in Lusaka, Zambia, Feb. 17, 2025. Hecker met with Nyoni prior to the opening ceremony of the 14th African Air Chiefs symposium aimed to strengthen regional partnerships and foster open dialogue, providing opportunities to assess capabilities and identify gaps to build further engagements between the U.S. and our African partners. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 4 of 6]",
        "url": "https://www.dvidshub.net/image/8873842/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Maintenance window scheduled to begin at February 14th 2200 est. until 0400 est. February 15th\nHome\nSECRETARY OF DEFENSE PETE HEGSETH\nCombatant Commands\nHoliday Greetings Map\nFeatures\nTaking Care of Our People\nNATO\nFocus on the Indo-Pacific\nSupport for Ukraine\nValue of Service\nFace of Defense\nScience and Technology\nContent\nImages\nVideo\nNews\nAudio\nGraphics\nPublications\nPodcasts\nWebcasts\nSeries\nStories\nStorytellers\nMedia Awards\nHometown Heroes\nHometown News\nReleases\nUnits\nNewswire\nMedia Requests\nCreate Request\nMedia Press Kit\nREGISTER\nLOGIN\nDVIDS DIRECT\nADMIN\nOPTIONS\nMY ALBUMS\nLOGOUT\nHome\nSECRETARY OF DEFENSE PETE HEGSETH\nCombatant Commands\nHoliday Greetings Map\nFeatures\nTaking Care of Our People\nNATO\nFocus on the Indo-Pacific\nSupport for Ukraine\nValue of Service\nFace of Defense\nScience and Technology\nContent\nImages\nVideo\nNews\nAudio\nGraphics\nPublications\nPodcasts\nWebcasts\nSeries\nStories\nStorytellers\nMedia Awards\nHometown Heroes\nHometown News\nReleases\nUnits\nNewswire\nMedia Requests\nCreate Request\nMedia Press Kit\nAbout DVIDS\nContact Us\nPrivacy & Security\nFAQs\nCopyright Information\nAccessibility Information\nCustomer Service\n2025 African Air Chiefs Symposium commences with opening ceremony [Image 4 of 6]\nContent Credentials\nIssued by: on\nVIRIN:\nDate Created:\nCity:\nState:\nCountry:\nZAMBIA\n02.17.2025\nCourtesy Photo\nU.S. Air Forces in Europe and Air Forces Africa\n✔ ✗ Subscribe\n33\nZambian Air Force Lt. Gen. Oscar Nyoni, Zambian Air Force commander, speaks during the opening ceremony for the 14th African Air Chiefs Symposium in Lusaka, Zambia, Feb. 17, 2025. The opening ceremony set the stage for vital discussions on strengthening multinational collaboration, and enhancing security cooperation among African nations. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)\nIMAGE INFO\nDate Taken: 02.17.2025 Date Posted: 02.17.2025 09:29 Photo ID: 8873842 VIRIN: 250217-F-GC270-1006 Resolution: 3770x2513 Size: 588.67 KB Location: ZM\nWeb Views: 1 Downloads: 0\nPUBLIC DOMAIN\nThis work, 2025 African Air Chiefs Symposium commences with opening ceremony [Image 6 of 6], must comply with the restrictions shown on https://www.dvidshub.net/about/copyright.\nGALLERY\nMORE LIKE THIS\nCONTROLLED VOCABULARY KEYWORDS\nNo keywords found.\nTAGS\nCeremony\nUSAF\nAAAF\nAACS 2025\nZAF\nOPTIONS\nRegister/Login to Download\nFlag Asset\n2025 African Air Chiefs Symposium commences with opening ceremony\nDVIDS Control Center\n404-282-1450\nWeb Support\ndvidsservicedesk@dvidshub.net\nCustomer Service\n1-888-743-4662\ndma.enterprise-customer-services@mail.mil\nUnits\nNewswire\nAbout DVIDS\nContact Us\nPrivacy & Security\nFAQs\nCopyright Information\nAccessibility Information\nCustomer Service\nMedia Requests\nCreate Request\nMedia Press Kit\nHometown News\nReleases\nStories\nStorytellers\nMedia Awards\nHometown Heroes\nContent\nImages\nVideo\nNews\nAudio\nGraphics\nPublications\nPodcasts\nWebcasts\nSeries\nFeatures\nTaking Care of Our People\nNATO\nFocus on the Indo-Pacific\nSupport for Ukraine\nValue of Service\nFace of Defense\nScience and Technology\nLinks\nLinks Disclaimer\nNo FEAR Act\nSmall Business Act\nOpen Government\nStrategic Plan\nFOIA\nUSA Gov\nInspector General\nWeb Policy\nEEO\nSexual Assault Prevention\nDVI Records Schedule\nDVI Executive Summary\nSection 3103\nVersion: 5b7a28832548e99c96ea5a747e477c373ddcb8c1_2025-02-11T16:48:32"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 5 of 6]",
        "url": "https://www.dvidshub.net/image/8873843/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Content Credentials Issued by: on VIRIN: Date Created: City: State: Country:\n\nU.S. Air Force Gen. James Hecker, U.S. Air Forces in Europe - Air Forces Africa commander, speaks during the opening ceremony for the 14th African Air Chiefs Symposium in Lusaka, Zambia, Feb. 17, 2025. The opening ceremony set the stage for vital discussions on strengthening multinational collaboration, and enhancing security cooperation among African nations. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)"
    },
    {
        "title": "2025 African Air Chiefs Symposium commences with opening ceremony [Image 3 of 6]",
        "url": "https://www.dvidshub.net/image/8873841/2025-african-air-chiefs-symposium-commences-with-opening-ceremony",
        "published_date": "2025-02-17T14:29:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Content Credentials Issued by: on VIRIN: Date Created: City: State: Country:\n\nAir chiefs and government officials from the Republic of Zambia as well as the U.S. Air Forces in Europe - Air Forces Africa command team attend the 14th African Air Chiefs symposium at Lusaka, Zambia. AACS aimed to strengthen regional partnerships, provide opportunities to assess capabilities and identify gaps to build further engagements between the U.S. and our African partners. (U.S. Air Force photo by Senior Airman Seleena Muhammad-Ali)"
    },
    {
        "title": "Local Authorities Elections bill passed by special majority in Parliament",
        "url": "https://www.onlanka.com/news/local-authorities-elections-bill-passed-by-special-majority-in-parliament.html",
        "published_date": "2025-02-17T14:29:07+00:00",
        "source_name": "Unknown source",
        "author": "Editor",
        "category": "general",
        "content": "Local Authorities Elections bill passed by special majority in Parliament\n\nPosted by Editor on February 17, 2025 - 7:59 pm\n\nThe Local Authorities Elections (Special Provisions) Bill was passed by a special majority in the Sri Lankan Parliament today, February 17, without any amendments.\n\nThe debate on the Bill’s Second Reading took place from 2:00 PM to 7:00 PM. Afterward, a total of 187 votes were cast in favor of the Bill.\n\nThe Bill was then considered at the Committee stage, followed by a division for the Third Reading. In the Third Reading, 158 votes were cast in favor of the Bill.\n\nBoth the Second and Third Readings of the Local Authorities Elections (Special Provisions) Bill were approved by a special majority in Parliament."
    },
    {
        "title": "3 Female Country Singers With Unmistakable Singing Voices",
        "url": "https://americansongwriter.com/3-female-country-singers-with-unmistakable-singing-voices/",
        "published_date": "2025-02-17T14:28:56+00:00",
        "source_name": "Unknown source",
        "author": "Jacob Uitti",
        "category": "general",
        "content": "Singing is an art form. And people spend hours and days and weeks and lifetimes trying to master it. To get that right note, to get that right range, that perfect vocal dexterity, and delivery. But sometimes a voice has that special quality that no one can teach. It’s not about practice makes perfect. It’s about gifts a person is born with and decides to share.\n\nVideos by American Songwriter\n\nHere below, we wanted to examine three such offerings. A trio of songs that display marvelous, unmistakable singing voices in country music, a genre where voice and authenticity are key. And this time, we’re going to do it by examining the women’s side of the bracket. Indeed, these are three female country singers with unmistakable singing voices.\n\n[RELATED: American Songwriter November Cover Story: Dolly Parton—The Eternal Artist]\n\nDolly Parton\n\nDolly Parton’s voice is like a butterfly. It’s slight and fluttery but mighty enough to touch every corner of the room. And when she sings songs like “Jolene,” that monarch is carrying poison on its wings, right to the ears of the woman who tried to take her husband. Indeed, Parton is one of those instantly recognizable singers whose voice feels comforting—unless you’re that red-headed Jolene. When used to sing songs like “I Will Always Love You,” you can feel as if you’re flying, too.\n\nPatsy Cline\n\nThere are singers and then there’s Patsy Cline. When people talk about certain others being used as instruments of God, Patsy Cline is right up there at the top of the list of those who just might be. Her iconic voice leaps from her lips and fills a room like the scent of baked bread. It’s sumptuous and unmistakable and cannot be replicated. Indeed, you’d be crazy for trying.\n\nLoretta Lynn\n\nIf you looked up perfect country singing voice in the dictionary, there wouldn’t have to be any words, not a single definition. All you would need is a picture of Loretta Lynn. With her rich, clear-as-a-bell voice, all you need is a snare drum and a slide guitar to keep the party going all night. While her voice is lively and entertaining, it is also as if your neighbor is singing to you. As if you’ve known Loretta your entire life. She just knows what notes to hit.\n\nPhoto by John Seakwood/Disney General Entertainment Content via Getty Images"
    },
    {
        "title": "WATCH: Trump takes victory lap at Daytona 500 as he overhauls government",
        "url": "https://abcnews.go.com/GMA/News/video/trump-takes-victory-lap-daytona-500-overhauls-government-118888066",
        "published_date": "2025-02-17T14:28:43+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Trump takes victory lap at Daytona 500 as he overhauls government\nPresident Donald Trump greeted NASCAR fans over the weekend as Elon Musk and the Trump administration target roughly 200,000 federal employees who have been on the job for less than a year.\nFebruary 17, 2025\nAdditional Live Streams\nLive\nABC News Live\nView of Paris as European leaders meets to discuss Ukraine\nLIVE\nView of White House on Presidents Day\nLIVE\nHospital in Rome where Pope Francis is hospitalized for bronchitis\nLIVE\nView of Independence Square in Kyiv, Ukraine\nLIVE\nTop Stories\n2:00\nDeadly flash flooding hits parts of the South\n3 hours ago\nThe next cross-country winter storm\n1:16\nSnowstorm causes travel chaos in Northeast\n1:07\nUnited flight diverted to Newfoundland for multiple days\n2:06\nTrump takes victory lap at Daytona 500 as he overhauls government\n3:07\nABC News Live Presents\n23:38\nAmerica’s Care Crisis\nFeb 13, 2025\nImmigration Crackdown\n22:52\nShot in the Dark: Weight Loss Injection Wars\n24:51\nOctober 7th: The Race to Survive\n27:01\nJanuary 6th: The Fight to Rewrite History\n23:59\nABC News Specials on\nImpact X Nightline: On the Brink\nDec 14, 2023\nImpact X Nightline: On the Brink\nImpact X Nightline: Unboxing Shein\nThe Lady Bird Diaries\nImpact X Nightline: It's Britney\nImpact X Nightline: Natalee Holloway -- A Killer Confesses\nShare a story idea with ABC News Live\nABC News Network\nAbout Nielsen Measurement\nChildren's Online Privacy Policy\nContact Us\nDo Not Sell or Share My Personal Information\nInterest-Based Ads\nPrivacy Policy\nTerms of Use\nYour US State Privacy Rights\n© 2025 ABC News"
    },
    {
        "title": "Could Nvidia Buck The Trend Of A Wider Market Downturn?",
        "url": "https://seekingalpha.com/article/4758990-could-nvidia-buck-the-trend-of-a-wider-market-downturn?source=feed_all_articles",
        "published_date": "2025-02-17T14:27:50+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
    },
    {
        "title": "Sanam Teri Kasam Re-Release Box Office: Bigger Hit Than Tere Naam With 365% Higher Profit Than Salman Khan’s Tragic Love Story!",
        "url": "https://www.koimoi.com/box-office/sanam-teri-kasam-re-release-box-office-bigger-hit-than-tere-naam-with-365-higher-profit-than-salman-khans-tragic-love-story/",
        "published_date": "2025-02-17T14:27:50+00:00",
        "source_name": "Unknown source",
        "author": "Trisha Gaur",
        "category": "general",
        "content": "Harshvardhan Rane and Mawra Hocane’s film Sanam Teri Kasam has officially nailed the Valentine’s season in the year 2025, with the re-release of the film enjoying a golden run at the box office! In 10 days, the total collection of the romantic drama stands at 30.8 crore.\n\nBudget & Recovery\n\nThe film, in its initial run in 2016, earned 9 crore at the box office. Along with the re-release collection, the total box office of the film stands at 39.8 crore. Mounted on a budget of 18 crore, the tragic love story has churned out a profit of 121.11%.\n\nSanam Teri Kasam Re-Release Box Office\n\nOn the tenth day, despite new releases, the film earned 1.2 crore, which was a very minimal drop from the previous day, which earned 1.25 crore. Sanam Teri Kasam re-release closed its second weekend at 3.95 crore.\n\nSurpasses The Profit Of Tere Naam!\n\nInterestingly, the film is closely connected to Salman Khan and Tere Naam. The superstar was one of the actors who predicted that the film will be a superhit. In fact, he even promoted the film in 2016 and shared that one of the songs of the film was supposed to be featured in Tere Naam but could not! The song was Haal-E-Dil Mera, Poocho Naa Sanam.\n\nInterestingly, Harshvardhan Rane and Mawra Hocane’s film has now surpassed the profits of Tere Naam at the box office. In fact, it stands 365% higher than Salman Khan’s tragic love story.\n\nTere Naam Budget & Profit\n\nTere Naam was mounted on a budget of 12 crore and it earned 15.12 crore in is lifetime, churning out a profit of only 26.17%. So, officially, Sanam Teri Kasam now is actually a bigger hit than Salman Khan‘s Tere Naam!\n\nNote: Box office numbers are based on estimates and various sources. Numbers have not been independently verified by Koimoi.\n\nCheck out the box office collections and verdicts of Hindi films of 2025 here.\n\nFor more stories and updates, stay tuned to Koimoi.\n\nMust Read: Chhaava Box Office: 93% Budget Recovered, Game Of Profits Loading For Vicky Kaushal Starrer!\n\nFollow Us: Facebook | Instagram | Twitter | Youtube | Google News"
    },
    {
        "title": "What Would Be Involved in a Trump Economic Emergency Declaration?",
        "url": "https://247wallst.com/economy/2025/02/17/what-would-be-involved-in-a-trump-economic-emergency-declaration-2/",
        "published_date": "2025-02-17T14:27:32+00:00",
        "source_name": "Unknown source",
        "author": "John Seetoo",
        "category": "general",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "An Important Warning For Dividend Investors",
        "url": "https://seekingalpha.com/article/4758989-important-warning-for-dividend-investors?source=feed_all_articles",
        "published_date": "2025-02-17T14:27:26+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Samuel Smith has a diverse background that includes being lead analyst and Vice President at several highly regarded dividend stock research firms and running his own dividend investing YouTube channel. He is a Professional Engineer and Project Management Professional and holds a B.S. in Civil Engineering & Mathematics from the United States Military Academy at West Point and has a Masters in Engineering from Texas A&M with a focus on applied mathematics and machine learning.\n\nSamuel leads the High Yield Investor investing group. Samuel teams up with Jussi Askola and Paul R. Drake where they focus on finding the right balance between safety, growth, yield, and value. High Yield Investor offers real-money core, retirement, and international portfolios. The service also features regular trade alerts, educational content, and an active chat room of like-minded investors.\n\nPerspective: \"Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. But store up for yourselves treasures in heaven, where neither moth nor rust destroys, and where thieves do not break in or steal; for where your treasure is, there your heart will be also ... For what will it profit a man if he gains the whole world and forfeits his soul?\" ~ Jesus (Matthew 6:19-21; 16:26)\n\nLearn more"
    },
    {
        "title": "Red Sox reportedly inquired Padres about possible trade for their ace",
        "url": "https://www.boston.com/sports/boston-red-sox/2025/02/17/red-sox-padres-dylan-cease-mlb-trade-rumors/",
        "published_date": "2025-02-17T14:27:08+00:00",
        "source_name": "Unknown source",
        "author": "Conor Roche",
        "category": "general",
        "content": "Red Sox Red Sox reportedly inquired Padres about possible trade for their ace Dylan Cease, a two-time All-MLB second-team pitcher, has been rumored to be on the trade market as he enters the final year of his contract. Padres ace Dylan Cease has been one of the game's best pitchers over the last three years. (AP Photo/Ashley Landis)\n\nAfter acquiring a pair of All-Star starting pitchers earlier in the offseason, the Red Sox are possibly interested in adding another.\n\nThe Red Sox have “been in touch” with the Padres about a possible trade for ace Dylan Cease, MassLive’s Sean McAdam reported. The Red Sox’ negotiations were characterized as “due diligence” at the moment, McAdam added in his report.\n\nCease has been one of the game’s top pitchers over the last few seasons, posting a 3.40 ERA since 2022. He’s also recorded two top-five Cy Young finishes in that stretch, finishing second in AL Cy Young voting when he was the White Sox in 2022 before a fourth-place finish in NL Cy Young voting in 2024.\n\nAdvertisement:\n\nThe 29-year-old Cease is entering the final year of his contract. The Padres have also been cutting payroll since the passing of long-time owner Peter Seidler in November 2023 as there’s been a battle for the controlling stake of the team.\n\nAs Cease could become expendable, though, trading for him likely wouldn’t come cheap. The Padres gave up three of their top 10 prospects (No. 5 RHP Drew Thorpe, No. 7 OF Samuel Zavala, No. 8 RHP Jairo Irairte, per MLB Pipeline) to acquire Cease from the White Sox last year. Thorpe was also ranked 85th in MLB Pipeline’s top 100 prospects at the time of the trade.\n\nAdvertisement:\n\nUsing MLB Pipeline’s most recent prospect rankings, a comparable package for the Red Sox would include SS Yoeilin Cespedes, RHP Luis Perales, and RHP David Sandlin. McAdam noted that Wilyer Abreu could be the centerpiece of a possible deal for Cease. Abreu had a strong rookie season in 2024, hitting .253 with 15 homers and a .781 OPS. The 25-year-old outfielder also has five years left of team control.\n\nAdditionally, Cease is represented by Scott Boras, who typically has his best players hit the open market. Cease also isn’t expected to sign an extension, per MLB.com’s AJ Cassavell.\n\nThe Red Sox aren’t in desperate need of pitching help. They traded for All-Star Garrett Crochet following his breakout season and signed former Dodgers star Walker Buehler in December. They also added Angels starting pitcher Patrick Sandoval, who won’t be ready to start the year as he rehabs from Tommy John surgery.\n\nThose moves have caused the Red Sox to float the possibility of starting the year with a six-man rotation. After the team landed Alex Bregman, Alex Cora hinted that some more moves might be on the way.\n\n“We talked about winning the last few years, a thing that we haven’t done,” Cora told reporters on Saturday. “I think the front office talked — we talked as an organization at the end of the season last year, and (concluded) we need to be more aggressive in the offseason and execute.\n\nAdvertisement:\n\n“So far, we’ve done a good job. We haven’t stopped, though. We aren’t done yet, we’re still trying to improve the roster which is the most important thing. I think the guys in the clubhouse, they understand that.”"
    },
    {
        "title": "The anti-Musk protest movement is expected to ramp up with Congress on recess",
        "url": "https://abcnews.go.com/Business/wireStory/anti-musk-protest-movement-expected-ramp-congress-recess-118891582",
        "published_date": "2025-02-17T14:27:02+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "President Donald Trump's billionaire top lieutenant, Elon Musk, is the focus for thousands of Democratic activists launching a massive protest campaign this week\n\nThe anti-Musk protest movement is expected to ramp up with Congress on recess\n\nNEW YORK -- NEW YORK (AP) — Donald Trump is the president, but billionaire Elon Musk is the focus for thousands of Democratic activists launching a protest campaign this week to fight the Trump administration's push to gut federal health, education and human services agencies.\n\nHundreds of protests are scheduled outside congressional offices and Tesla dealerships, with organizers hoping to send a pointed message to members of Congress who are on recess this week.\n\nThe backlash still hasn't approached the intensity of protests during and after Trump's first inauguration eight years ago. But a loose coalition of Democrats and progressives is coalescing around Musk's rise as Trump's top lieutenant and his purge of the federal bureaucracy.\n\n“He’s a major weak link in the MAGA coalition,” Ezra Levin, co-founder of the progressive group Indivisible, said of Musk. “I can’t think of something that polls worse than the richest man in the world is coming after your Social Security check or your Meals on Wheels or your Head Start.”\n\nIndivisible, which claims more than 1,300 local chapters nationwide, is encouraging members to protest at the offices of their members of Congress, regardless of political party. The group also offered a step-by-step guide for protesting at dealerships for Tesla, Musk's electric vehicle company.\n\nThe memo encourages protesters to stay on sidewalks and public spaces and to avoid any actions that might directly interfere with business operations, such as blocking entrances or trespassing on private property. It also calls for Tesla protesters to stay on message: “This is about Musk’s political takeover, not Tesla, SpaceX, or X as companies.”\n\nVermont Sen. Bernie Sanders is launching what he’s calling “a national tour to fight oligarchy” with stops in working-class districts of Iowa and Nebraska this week.\n\nDemocratic National Committee Chair Ken Martin will hit the road for the first time as party leader as well. The newly elected DNC chair will travel to Pennsylvania, Texas, Illinois, Wisconsin and Missouri in the coming days to meet with local Democratic officials and labor leaders, spokesperson Hannah Muldavin said.\n\nLike the protesters, Martin is expected to seize on Musk’s role. During a meeting with labor leaders in Pittsburgh, for example, he plans to highlight Musk’s recent focus on the Department of Labor, which could put “the integrity of data like the unemployment rate and inflation rate at risk, which is important for a stable U.S. economy and, by extension, working people,” Muldavin said.\n\nAware of the intense displeasure from their party’s base, many House Democrats plan to be proactive.\n\nThe House Democratic Policy and Communications Committee issued a memo ahead of the recess instructing Democrats to embrace “nine days of visibility” and said it was essential for members to host one town hall, in-person or via telephone, and at least one community event that highlights the \"devastating impacts” of Trump and Musk’s actions.\n\nThe wave of protests comes at a critical moment as fractured Democrats struggle to stop the Republican president’s purge of the federal bureaucracy, which features thousands of layoffs inside departments focused on public health, education, veterans affairs and human services, among others.\n\nFirings in recent days at the Department of Veterans Affairs include researchers working on cancer treatment, opioid addiction, prosthetics and burn pit exposure, according to U.S. Sen. Patty Murray, a Democrat from Washington state. The cuts also include more than 5,000 employees at the Department of Health and Human Services and roughly one-tenth of the workforce at the Centers for Disease Control and Prevention.\n\nIn some cases, Musk’s team is trying — with Trump's blessing but without congressional approval — to shutter entire agencies, including the U.S. Agency for International Development, the Department of Education and the U.S. Consumer Financial Protection Bureau.\n\nTrump has defended the cuts as necessary to eliminate waste and fraud. And he has praised Musk’s work with his Department of Government Efficiency, or DOGE, saying it has found “shocking” evidence of wasteful spending. He signed an executive order expanding Musk’s influence.\n\nMusk, meanwhile, has defended the swift and extensive cuts he’s pushing across the federal government while acknowledging there have been mistakes.\n\nDemocrats in Congress condemn the moves as dangerous, but without control of either chamber of Congress, there is little they can do to stop the Trump administration aside from turning to the courts. Still, three of the nation's largest progressive groups — Indivisible, MoveOn and the Working Families Party — are coordinating this week's protests to send a clear message to elected officials in both major political parties that they must do more.\n\nStill, Democratic members of Congress may face their own voters' fury.\n\nMoveOn, which boasts a membership of nearly 10 million, is hosting dozens of rallies outside town halls and congressional offices for those members who do not host public events. The group will focus on “persuadable House Republicans whose votes will be crucial to opposing the Trump-Musk agenda,” according to a preview of its recess week plan. But there will also be rallies targeting House Democratic Leader Hakeem Jeffries and Senate Democratic Leader Chuck Schumer, both of New York, among other Democrats.\n\n“We are seeing a true resurgence in energy opposing what Trump, Musk and Republicans are doing to our country,” MoveOn executive director Rahna Epting said, adding that “people are mad as hell.”\n\nThe Working Families Party is focusing protests in the districts of vulnerable Republicans in states such as California, New Jersey, New York, Pennsylvania and Wisconsin. The actions will feature people directly impacted by the Trump administration's cuts, including special education teachers, nurses and Head Start workers, according to Working Families spokesman Ravi Mangla.\n\n“A lot of Republicans,\" Mangla said, “have not have had their feet held to the fire.”"
    },
    {
        "title": "Fintechs bet on RuPay UPI credit cards as next growth engine",
        "url": "https://www.thehindubusinessline.com/companies/fintech-startups-leverage-rupay-credit-cards-linked-to-upi-for-seamless-transactions-expanding-credit-access-and-revenue-opportunities/article69230497.ece",
        "published_date": "2025-02-17T14:26:23+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "business",
        "content": "Fintech start-ups are unlocking another growth lever as Rupay credit cards which can be linked to the unified payments interface (UPI), are slowly catching up.\n\nFintechs like Rio, Kiwi, and Kredit.Pe and others are betting on RuPay credit cards linked to UPI, making credit transactions seamless across merchants.\n\nWhile banks issue RuPay credit cards, these fintechs serve as facilitators, handling distribution, marketing, rewards, and loyalty programs. Additionally, they collaborate with major merchants to offer cashback incentives, driving consumer adoption and increasing transaction volumes.\n\n“We had a strong hypothesis: once customers start using a credit card for UPI transactions, they naturally begin shifting their savings account UPI transactional. This transition is driven by convenience and an elevated experience. Over time, muscle memory shifts away from platforms like Google Pay and PhonePe as users get accustomed to the enhanced benefits of credit card payments on UPI,” said Mohit Bedi Co-Founder and CBO Kiwi.\n\nKiwi, which has raised close to $20 million in funding, has a virtual RuPay credit card platform, enabling users to make UPI-based merchant payments without the need for a physical card. The platform has facilitated transactions worth around Rs 300 crore monthly.\n\nThe product offers customers a credit-free period of 40-50 days and reward points, along with the ease of use of and acceptance of UPI among a large segment of merchants.\n\nExpanding credit access\n\nFintechs have identified key user segments that benefit significantly from this shift. First, existing credit card holders now find themselves able to use their cards at small merchants, many of whom previously couldn’t accept credit payments due to the lack of POS machines.\n\n“The RuPay credit card is the only card that will work on merchants who don’t have a POS machine,” said Prakash Sikaria, Founder and CEO of super.money. This opens the door for consumers to use credit at small businesses, a market traditionally underserved by credit card infrastructure.\n\nSecondly, by creating access to credit for those who may not have qualified for traditional unsecured cards. Through secured RuPay cards, fintechs are giving many first-time credit users the chance to build their credit history.\n\nA secured credit card is issued against a fixed deposit (FD), where the bank sets the card’s credit limit based on the FD amount. This ensures that even if a customer defaults, the bank can recover its funds without any risk to the principal.\n\nTo expand credit access while minimising risk, super.money has adopted the secured credit model. “There is a huge base of customers who are not being given an unsecured card. A secured card is a product catered to that demand, allowing more people to access credit,” added Sikaria.\n\nInnovations for revenue\n\nAs fintechs continue to expand the reach of RuPay credit cards on UPI, they are also innovating new ways to generate revenue.\n\nMost of these companies operate as credit enablers rather than direct issuers, partnering with banks to distribute and manage RuPay credit cards. This allows them to earn through card activation incentives and a share of user spending.\n\n“Every time a bank issues a credit card through Kiwi, we earn a distribution payout, similar to any third-party agent,” said Bedi.\n\nAdditionally, fintechs are monetising user engagement and transaction volumes. Unlike traditional credit card holders, who typically make around 8–9 transactions per month, users of UPI-linked RuPay credit cards are spending much more frequently. “In a standard credit card setup, the average user makes fewer than 10 transactions a month. However, cash credit on UPI transactions, for cards that are managed by Kiwi, do about 22 to 24 transactions a month. Basically, customers pull out kiwi almost everyday,” he added. This higher transaction frequency enhances user retention and increases the potential for fintechs to earn commission-based revenues from banks.\n\nAnother key revenue driver is merchant partnerships, where fintechs collaborate with large retailers to offer exclusive rewards, discounts, and cashback incentives. These partnerships encourage users to transact via RuPay credit cards on UPI, increasing overall spending while driving value for both merchants and fintech platforms. “UPI is typically seen as a convenience-driven payment mode, whereas credit cards are about rewards and benefits,” said Sikaria. “By combining the two, we’re creating an ecosystem where UPI transactions become more rewarding, encouraging users to spend more.”\n\nBeyond transactions, fintechs are also exploring value-added financial products, such as credit lines on UPI, secured credit cards, and digital wallets, to build a sustainable business model. Many are now looking at UPI Lounge Access, BNPL (Buy Now, Pay Later) solutions, and subscription-based financial tools to further monetize their platforms.\n\nKiwi has launched UPI-based lounge access at 22 airports, allowing users to enter lounges simply by scanning a QR code.\n\nAs UPI evolves beyond basic payments, fintechs are positioning themselves not just as payment facilitators but as comprehensive financial service providers."
    },
    {
        "title": "NDTV Profit Conclave: Blueprint For Viksit Bharat At 2047",
        "url": "https://www.ndtvprofit.com/business/ndtv-profit-conclave-blueprint-for-viksit-bharat-at-2047",
        "published_date": "2025-02-17T14:26:13+00:00",
        "source_name": "Unknown source",
        "author": "Shreya Sur",
        "category": "business",
        "content": "NDTV Profit is all set to host a conclave themed 'Blueprint for Viksit Bharat @2047' on Tuesday in Mumbai. The event will bring together India's most prominent corporate and political leaders to explore the country's revolutionary roadmap to becoming a developed nation by its centenary.\n\nThe conclave will serve as a vital platform for advancing the agenda for Viksit Bharat by 2047 — a national initiative focused on inclusive development, sustainable progress, and robust governance, with a strong emphasis on youth empowerment.\n\nKey speakers include Union Minister for Commerce and Industry Piyush Goyal, State Bank of India Chairman CS Setty, Mahindra Group Chief Executive Officer Anish Shah, and Godrej Industries Group Chairperson Nadir Godrej.\n\nThe event will begin with a welcome address by NDTV's Editor-in-Chief Sanjay Pugalia at 10:50 a.m. This will be followed by a panel discussion on the subject 'The Indian Investor Comes of Age', which will witness participation from Ridham Desai, chief India equity strategist of Morgan Stanley; Dinesh Thakkar, chairman of Angel One Ltd., and Ashishkumar Chauhan, managing director of NSE.\n\nFor full schedule and details of the panel discussions at the NDTV Profit Conclave, check here.\n\nEchoing Prime Minister Narendra Modi's statement that \"youth power is both the agent of change and the beneficiaries of change,\" the conclave will highlight how this vision is being realised in important industries, highlighting India's commitment to long-term, meaningful growth and global leadership.\n\nThe list of India Inc leaders participating in the event also includes Kotak Mahindra Bank MD and CEO Ashok Vaswani, Welspun Living CEO Dipali Goenka, Wockhardt Group Founder Chairman Dr. Habil Khorakiwala, and Kotak Mahindra Asset Management Co. MD Nilesh Shah, among others.\n\nAssociation of Mutual Funds in India Chairman Navneet Munot, Edelweiss Mutual Fund CEO Radhika Gupta and Kaynes Technology CEO Rajesh Sharma will also be among the speakers at the conclave."
    },
    {
        "title": "Swalwell faces social media backlash for post tying Trump to Georgia small plane crash",
        "url": "https://www.foxnews.com/politics/swallwell-faces-social-media-backlash-post-tying-trump-georgia-small-plane-crash",
        "published_date": "2025-02-17T14:26:05+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Rep. Eric Swalwell, D-Calif., is facing backlash online after suggesting President Donald Trump is to blame for a small plane crash in Georgia this weekend.\n\nSwalwell took to social media Monday morning to declare that Trump has had \"more planes crash\" in his first month in office than any other U.S. president. The lawmaker made the comment in reaction to a small private plane crash that took place this weekend in Covington, Georgia, which left two people dead.\n\nSocial media users began to pile on immediately, calling out Swalwell for what they saw as an unfair connection to Trump.\n\n\"Are you suggesting the catalysts for those crashes were all caused by policies changed in the last month?\" one user wrote.\n\nHARROWING VIDEO FROM MILITARY BASE SHOWS NEW ANGLE OF MIDAIR CRASH CATASTROPHE\n\n\"You really do have TDS. Grab some coffee and take a walk,\" wrote another user who goes by the name of SouthernRepublicanMomma.\n\nSwalwell's office did not immediately respond to a request for comment from Fox News Digital.\n\nFAA, NTSB TO BRIEF SENATORS ON WASHINGTON, DC, MIDAIR COLLISION\n\nGeorgia's crash saw a single-engine airplane take off from the Covington Municipal Airport at 11 p.m. on Saturday. Ground control lost communication with the plane roughly 20 minutes later, at which point police officers located the plane crashed near the runway.\n\nThe plane's two occupants were immediately announced dead at the scene.\n\n\"On February 15, 2025, the Covington Police Department officers responded to the Covington Municipal Airport at approximately 11:21 p.m. after receiving a call from the FAA in reference to a single-engine aircraft that had taken off at approximately 11:00 p.m. There was no further communication from the aircraft after takeoff,\" the Covington Police Department said in a statement.\n\nThe National Transportation Safety Board (NTSB) has confirmed they are investigating the crash.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe incident comes in the wake of multiple other plane crashes in recent weeks, the most dramatic being the collision of a helicopter and a commercial airliner in the skies over Washington, D.C. last month."
    },
    {
        "title": "Swalwell faces social media backlash for post tying Trump to Georgia small plane crash",
        "url": "https://www.foxnews.com/politics/swalwell-faces-social-media-backlash-post-tying-trump-georgia-small-plane-crash",
        "published_date": "2025-02-17T14:26:05+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "politics",
        "content": "Rep. Eric Swalwell, D-Calif., is facing backlash online after suggesting President Donald Trump is to blame for a small plane crash in Georgia this weekend.\n\nSwalwell took to social media Monday morning to declare that Trump has had \"more planes crash\" in his first month in office than any other U.S. president. The lawmaker made the comment in reaction to a small private plane crash that took place this weekend in Covington, Georgia, which left two people dead.\n\nSocial media users began to pile on immediately, calling out Swalwell for what they saw as an unfair connection to Trump.\n\n\"Are you suggesting the catalysts for those crashes were all caused by policies changed in the last month?\" one user wrote.\n\nHARROWING VIDEO FROM MILITARY BASE SHOWS NEW ANGLE OF MIDAIR CRASH CATASTROPHE\n\n\"You really do have TDS. Grab some coffee and take a walk,\" wrote another user who goes by the name of SouthernRepublicanMomma.\n\nSwalwell's office did not immediately respond to a request for comment from Fox News Digital.\n\nFAA, NTSB TO BRIEF SENATORS ON WASHINGTON, DC, MIDAIR COLLISION\n\nGeorgia's crash saw a single-engine airplane take off from the Covington Municipal Airport at 11 p.m. on Saturday. Ground control lost communication with the plane roughly 20 minutes later, at which point police officers located the plane crashed near the runway.\n\nThe plane's two occupants were immediately announced dead at the scene.\n\n\"On February 15, 2025, the Covington Police Department officers responded to the Covington Municipal Airport at approximately 11:21 p.m. after receiving a call from the FAA in reference to a single-engine aircraft that had taken off at approximately 11:00 p.m. There was no further communication from the aircraft after takeoff,\" the Covington Police Department said in a statement.\n\nThe National Transportation Safety Board (NTSB) has confirmed they are investigating the crash.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe incident comes in the wake of multiple other plane crashes in recent weeks, the most dramatic being the collision of a helicopter and a commercial airliner in the skies over Washington, D.C. last month."
    },
    {
        "title": "PSG, Man United Table Verbal Contract Offers For Osimhen.",
        "url": "https://www.completesports.com/psg-man-united-table-verbal-contract-offers-for-osimhen/",
        "published_date": "2025-02-17T14:25:52+00:00",
        "source_name": "Unknown source",
        "author": "James Agberebi",
        "category": "sports",
        "content": "Ligue 1 champions Paris Saint-Germain and Premier League giants Manchester United have tabled verbal contract offers for Victor Osimhen, according to Turkish journalist Yagiz Sabuncuoglu.\n\nSabuncuoglu claimed that both clubs are set to trigger Osimhen’s €75 million release clause.\n\n\n\n\n\n“Victor Osimhen is about to sign a deal with a world-renowned management company. In fact, a Real Madrid player is helping facilitate these discussions. Sabuncuoglu told Turkish outlet Haber Sari Kirmizi.\n\n“This significantly reduces the chances of him staying at Galatasaray beyond June. Both PSG and Manchester United have made verbal offers regarding salary and contract length.\n\n“Since both clubs are willing to meet Napoli’s release clause, it will be incredibly difficult for Galatasaray to compete. A summer move looks almost certain.”\n\nGalatasaray had tried to secure Osimhen on a permanent deal – offering €65 million to Napoli, but the Italian club turned it down.\n\nOsimhen has been impressive in his loan spell at giants Galatasaray.\n\nThe 26-year-old has scored 17 goals and provided five assists in 23 appearances across all competitions.\n\n\n\n"
    },
    {
        "title": "IDF to Maintain Lebanon Presence Post-Deadline",
        "url": "https://www.theyeshivaworld.com/news/liveblogs/live-blog/2365646/idf-to-maintain-lebanon-presence-post-deadline.html",
        "published_date": "2025-02-17T14:25:51+00:00",
        "source_name": "Unknown source",
        "author": "TheOtherGuy",
        "category": "general",
        "content": "Skip to content\nFacebook Instagram Twitter Youtube\nIDF to Maintain Lebanon Presence Post-Deadline\nFebruary 17, 2025\n9:25 am\nNo Comments\nIDF will keep troops at five strategic points in Lebanon past the withdrawal deadline, with US approval. They’ve fortified Israeli defenses, cleared Hezbollah threats, and will enforce the ceasefire, hoping for Lebanese army action. Residents of northern Israel may return home from March 2 if peace holds.\nJoin the official YWN WhatsApp status\nJoin an official YWN WhatsApp group\nPrevPreviousNational Security Advisor Mike Waltz: Iran Will Never Have Nuclear Weapon\nNextCairo Building Collapse: 10 Dead, 8 Injured, Trapped FearedNext\nLeave a Reply\nYou must be logged in to post a comment.\nPopular Posts\nPolice Confiscate Palestinian Flags in Mea Shearim, Locals Throw Eggs During Operation [VIDEO & PHOTOS]\nFebruary 17, 2025\nHamas “Fattened Up” Ofer Calderon With Rotten Food Before His Release\nFebruary 17, 2025\nHezbollah Fired 5 Drones At Israel, IDF Hid It From The Public\nFebruary 17, 2025\nIDF Eliminates Hamas Leader In Lebanon Who Planned Attacks Against Jews Abroad\nFebruary 17, 2025\n500 Days: The Rosh Yeshivah Cries With The Hostages’ Families\nFebruary 17, 2025\n500 DAYS IN HELL: 73 Hostages, Alive & Dead, Remain In Captivity\nFebruary 17, 2025\nHistoric Petition Drive Launches to Revolutionize Kosher Financing for the Frum Community\nFebruary 16, 2025\n1 Comment\nWATCH: Trump on Hostage Deal: “You Do Whatever You Want”\nFebruary 16, 2025\nMAILBAG: Why Is Mental Health Treated As A Privilege, Not A Right?\nFebruary 16, 2025\n15 Comments\nWATCH: Is It Mutar To Post On WhatsApp To Purchase By Non-Jewish Stores Who Are Cheaper\nFebruary 16, 2025\n7 Comments\nCopyright © 2024 | The Yeshiva World. All rights reserved. Designed and powered by The Jewish Content Network"
    },
    {
        "title": "The Haunting Story Behind Billie Holiday’s “Strange Fruit”",
        "url": "https://americansongwriter.com/the-haunting-story-behind-billie-holidays-strange-fruit/",
        "published_date": "2025-02-17T14:25:49+00:00",
        "source_name": "Unknown source",
        "author": "Hal Horowitz",
        "category": "general",
        "content": "The legacy of protest songs is rich, deep, and musically diverse. There are tunes in almost any genre that, over the decades, carry the socio-political messages of the times and, often frustratingly, remain relevant today. From Woody Guthrie and Bob Dylan to Bob Marley, the Staple Singers, and even Beyonce, these typically transcend the era in which they were initially popular.\n\nVideos by American Songwriter\n\nThat’s certainly the case with “Strange Fruit.” The haunting ballad, part jazz/part offbeat folk, was penned in the late ‘30s. Its spellbinding, sometimes brutally evocative lyrics describe lynchings in the American South. Perhaps most astonishing is that a white Jewish communist teacher from New York City created it.\n\nWhat’s the story behind that?\n\nThe author of “Strange Fruit” was a Jewish high school instructor with socialist connections named Abel Meeropol. In 1921, he graduated from and taught English at DeWitt Clinton High School in The Bronx, New York. During his time there, one of his students was James Baldwin, later a key advocate and scholar in the civil rights movement.\n\nIn the mid-’30s, Meeropol was stricken by a newspaper picture taken in 1930 of a lynching of two Black men, shown hanging from trees in Marion, Indiana. So moved and horrified by that photograph, which itself is now iconic, Meeropol wrote a poem expressing his feelings about the shocking events caused by racial unrest in the United States. He named it “Bitter Fruit.”\n\nHis riveting words, which never directly mention the word “lynching,” remain intense and disturbing despite, or more likely because of, their implied imagery.\n\n“Southern trees bear a strange fruit / Blood on the leaves and blood at the root / Black body swinging in the Southern breeze / Strange fruit hanging from the poplar trees...”\n\nThe poem was published in a 1937 issue of a regional periodical for New York City teachers. But it soon became a song, with its melancholy music, also by Meeropol under the pseudonym of Lewis Allan. Changed to “Strange Fruit,” the melody, first performed by Meeropol’s wife, Anne, was delivered at union rallies and eventually at Madison Square Garden, where it was sung by a Black vocalist named Laura Duncan.\n\nHow did “Strange Fruit” get popular?\n\nExactly how and who initially presented the song to Billie Holiday is the subject of some dispute. Regardless, “Strange Fruit” quickly became a controversial feature of her sets. The singer was only 23 when she introduced the song in March 1939 at the New York club Café Society. She closed her show with it, requiring all waiters and the bar to stop serving, and the room completely dark with just a spotlight on her face.\n\nThere are only three verses and no chorus.\n\nAfter the final words, Here is fruit for the crows to plug / For the rain to gather, for the wind to suck / For the sun to rot, for the trees to drop / Here is a strange and bitter crop,the light was turned off, she left the stage and did not return for an encore.\n\nWhat was the reaction?\n\nPredictably, the song’s divisive nature had various, usually extreme, responses. Some audiences loved it, but others were shocked and even revolted since the mournful lament was like nothing else in the singer’s repertoire. Columbia, her label at the time, refused to record it, although they approved a one-session release from her contract to allow her to do so for another company. Even her producer, the legendary John Hammond, declined to be involved. “Strange Fruit” was finally waxed on April 20, 1939, for the indie Commodore on its Vocalion imprint.\n\nDavid Margolick, author of Strange Fruit: Billie Holiday and the Biography of a Song, wrote, “For mainstream institutions—record labels, radio stations —the song was too hot to touch. Beyond a group of left-wing progressives, largely white, most people wouldn’t have known the song. The Black press barely mentioned it: It was too radioactive even for them.” Nevertheless, “Strange Fruit” eventually moved a million copies and became Holiday’s biggest-selling record. That was partly due to Nina Simone resurrecting it in 1965 for the civil rights movement.\n\nWho else sang it?\n\nFor a song so closely tied to Billie Holiday’s penetrating vocals and the opposite of a feel-good pop tune, “Strange Fruit” has a remarkably extensive, vibrant, and varied history of covers.\n\nIn addition to Simone’s equally transfixing approach, it has been recorded by Annie Lennox, in a blues version by Beth Hart with Joe Bonamassa, and by reggae band UB40. Soul singer Andra Day revived it for her turn as Holiday in the 2021 movie The United States vs. Billie Holiday. And there was the Oscar-nominated Diana Ross, who famously played Holiday in Lady Sings the Blues.\n\nRegardless of the source, “Strange Fruit”’s staying power has weathered decades. It remains an entrancing, unsettling listen and a compelling lesson about America’s history, compacted into just 90 extraordinary words.\n\nPhoto by Gilles Petard_Redferns_GettyImages"
    },
    {
        "title": "WB Assembly Suspends 4 BJP MLAs for a Month; Suvendu Adhikari Is in the List",
        "url": "https://www.deccanchronicle.com/nation/wb-assembly-suspends-4-bjp-mlas-for-a-month-suvendu-adhikari-is-in-the-list-1861766",
        "published_date": "2025-02-17T14:25:42+00:00",
        "source_name": "Unknown source",
        "author": "Rajib Chowdhuri",
        "category": "general",
        "content": "Kolkata: Four West Bengal BJP MLAs including leader of the opposition Suvendu Adhikari were suspended by Assembly Speaker Biman Banerjee on Monday from the House for a month for their disorderly conduct.\n\nLater, Mr Adhikari announced a boycott of Chief Minister Mamata Banerjee's address to the House and a sit-in demonstration by his party MLAs at the Assembly gate on Tuesday in protest of the action.\n\nThis is the fourth time in the last three and half years the Nandigram BJP MLA faced marching orders from the House. The three other suspended MLAs are Agnimitra Paul of Asansol South, Bishwanath Karak of Goghat and Bankim Chandra Ghosh of Chakda.\n\nOn Monday, Ms Paul moved an adjournment motion to be read in the House on the celebration of Saraswati Puja at Jogesh Chandra Chaudhuri College in south Kolkata under police deployment this year.\n\nThe Speaker did not allow it. The BJP MLAs burst into protest, rushed to the well of the House and tore apart the papers. Shouting slogans, they also staged a walkout from the House when the Speaker warned them of action.\n\nTrinamul Congress chief whip Nirmal Ghosh urged the Speaker to suspend the BJP MLAs. Mr Banerjee said, “The behaviour of the leader of the opposition and other MLAs of his party is condemnable. Mr Ghosh has proposed to suspend them for a month or till the end of the session.”\n\nHe also ordered voting on the TMC proposal which was passed with support from the treasury bench. The Speaker then announced the one-month suspension of the four BJP MLAs.\n\nMr Adhikari questioned the action on three other MLAs when only he protested in the well. He said, “We will boycott the CM by shouting ‘Shame, Shame’ during her Assembly visit. We will also demonstrate at the Address gate on Tuesday.”"
    },
    {
        "title": "'Life-threatening cold' expected as polar vortex stretches across U.S. after deadly weekend flooding",
        "url": "https://www.wral.com/story/life-threatening-cold-expected-as-polar-vortex-stretches-across-u-s-after-deadly-weekend-flooding/21863680/",
        "published_date": "2025-02-17T14:25:08+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "LOUISVILLE, Ky. (AP) — Harsh weather moved west on Monday as a polar vortex was expected to grip the Rockies and the northern Plains after winter storms pummeled the eastern U.S. over the weekend, killing at least 10 people, including nine victims in Kentucky who died during flooding from heavy rains.\n\nThe National Weather Service warned of “life-threatening cold” into Tuesday, with temperatures in northeastern Montana predicted to dip as low as 45 degrees below zero (-42.7 degrees Celsius) with wind chills down to 60 below (-51 degrees Celsius).\n\nMeteorologists said several states would experience the 10th and coldest polar vortex event this season. Weather forces in the Arctic are combining to push the chilly air that usually stays near the North Pole into the U.S. and Europe.\n\nIn Kentucky, Gov. Andy Beshear said Sunday that the death toll rose to nine.\n\n“We just confirmed another weather-related death out of Pike County, bringing our total loss to 9 people.”\n\nBeshear had said earlier Sunday that at least 1,000 people stranded by floods had to be rescued. President Donald Trump approved Kentucky's request for a disaster declaration, authorizing the Federal Emergency Management Agency to coordinate relief efforts throughout the state.\n\nIn Alabama, the weather service in Birmingham said it had confirmed an EF-1 tornado touched down in Hale County. Storms there and elsewhere in the state destroyed or damaged a handful of mobile homes, downed trees and toppled power lines.\n\nA state of emergency was declared for parts of Obion County, Tennessee, after a levee failed on Saturday, flooding the small community of Rives, home to around 300 people in the western part of the state. “\n\nIn Atlanta, a person was killed when a large tree fell on a home early Sunday, according to Atlanta Fire Rescue Capt. Scott Powell.\n\nDangerously cold wind chill temperatures as low as 50 degrees below zero (minus 45.6) were expected in most of North Dakota, which remained under an “extreme cold warning” along with large swaths of South Dakota and Minnesota, according to the weather service.\n\nParts of Kentucky and Tennessee received up to 6 inches (15 centimeters) of rain, Bob Oravec, a senior forecaster with the National Weather Service, said Sunday.\n\nWater submerged cars and buildings in Kentucky and mudslides blocked roads in Virginia over the weekend. Flood warnings extended throughout Tennessee and Arkansas.\n\nThe mother and child were swept away Saturday night in Kentucky’s Bonnieville community, Hart County Coroner Tony Roberts said. In southeastern Kentucky, a 73-year-old man was found dead in floodwaters in Clay County, county Emergency Management Deputy Director Revelle Berry said. There were a total of four deaths in Hart County, Beshear said.\n\nIn West Virginia, 13 southern counties were under a state of emergency for flooding and some areas were cut off to vehicle traffic Sunday. Several volunteer fire departments dealt with flooding in their own buildings while answering rescue and evacuation calls.\n\nIce and snow made road travel treacherous in large swaths of Michigan, which remained under a winter weather advisory until Monday afternoon. Michigan State Police reported 114 crashes Sunday around the Detroit area since snow started falling Saturday.\n\n“Fortunately, most were one-car spin outs and there were no serious injuries,” Michigan State Police said on X.\n\nAuthorities in Colorado reported eight people were killed in fatal vehicle crashes since Valentine’s Day and warned drivers to be cautious as the weather made driving more difficult. The causes of the fatal crashes weren’t immediately known.\n\nAlso in Colorado, three state patrol cruisers that had pulled over along roadsides were struck by other vehicles, including one on Sunday where a trooper had stopped as officials prepared to close a road because of ice. In each case the troopers were out of their cruisers at the time and were uninjured.\n\nAvalanche warnings were issued for numerous areas of the Rocky Mountains stretching from Colorado to Washington state, with the danger rated highest in Utah.\n\nParts of a southwest Detroit neighborhood are submerged after a nearly century-old water main burst early Monday.\n\nThe 54-inch (137-centimeter) transmission main was built in 1930 and has left several feet of water over streets, sidewalks and yards, according to the Great Lakes Water Authority.\n\nCrews and contractors were in the area attempting to isolate the break. It was not clear what caused the main to burst, but temperatures late Sunday into Monday morning were well below zero degrees Fahrenheit (minus 17 degrees C).\n\nNo injuries have been reported. Firefighters used a ladder to help one person from the roof of a car in waist-deep water and a bulldozer was used to navigate a flooded street and help people leave a home, according to the fire department.\n\nMayor Mike Duggan says people impacted by the flooding can shelter in place if they have power and feel safe. Those who want to leave can call 911 and fire crews will help them from their homes and take them to a temporary shelter.\n\n___\n\nCorey Williams in Detroit; Sophia Tareen in Chicago; and Matthew Brown in Billings, Montana, contributed to this report."
    },
    {
        "title": "Insider Buying: Montanaro UK Smaller Companies (LON:MTU) Insider Buys 5,000 Shares of Stock",
        "url": "https://www.marketbeat.com/instant-alerts/insider-buying-montanaro-uk-smaller-companies-lonmtu-insider-buys-5000-shares-of-stock-2025-02-17/",
        "published_date": "2025-02-17T14:24:49+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Montanaro UK Smaller Companies (LON:MTU - Get Free Report) insider Yuuichiro Nakajima purchased 5,000 shares of the stock in a transaction on Friday, February 14th. The stock was acquired at an average cost of GBX 107 ($1.35) per share, with a total value of £5,350 ($6,730.41).\n\nGet MTU alerts: Sign Up\n\nMontanaro UK Smaller Companies Trading Down 0.2 %\n\nShares of LON:MTU opened at GBX 106.29 ($1.34) on Monday. Montanaro UK Smaller Companies has a 52-week low of GBX 95 ($1.20) and a 52-week high of GBX 113.50 ($1.43). The stock has a market cap of £176.81 million, a price-to-earnings ratio of 6.73 and a beta of 0.98. The company has a quick ratio of 41.12, a current ratio of 0.37 and a debt-to-equity ratio of 9.83. The business has a 50-day moving average price of GBX 104.09 and a 200-day moving average price of GBX 105.26.\n\nMontanaro UK Smaller Companies (LON:MTU - Get Free Report) last announced its quarterly earnings data on Friday, December 6th. The company reported GBX 2.20 ($0.03) earnings per share (EPS) for the quarter. Montanaro UK Smaller Companies had a return on equity of 13.16% and a net margin of 91.45%.\n\nMontanaro UK Smaller Companies Cuts Dividend\n\nThe company also recently disclosed a dividend, which was paid on Friday, February 7th. Stockholders of record on Thursday, January 16th were paid a GBX 1.03 ($0.01) dividend. This represents a dividend yield of 1.04%. The ex-dividend date of this dividend was Thursday, January 16th. Montanaro UK Smaller Companies's payout ratio is 31.67%.\n\nMontanaro UK Smaller Companies Company Profile\n\nThe Trust aims to achieve capital growth by investing in small companies listed on the London Stock Exchange or its Alternative Investment Market (AIM). It seeks relative outperformance of its benchmark, the Numis Smaller Companies Index. Montanaro Asset Management was founded by Charles Montanaro in 1991 with a vision to bring a different approach to SmallCap investing. We think of ourselves as an Oasis in the City.\n\nRecommended Stories\n\nThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.\n\nBefore you make your next trade, you'll want to hear this.\n\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis.\n\nOur team has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and none of the big name stocks were on the list.\n\nThey believe these five stocks are the five best companies for investors to buy now...\n\nSee The Five Stocks Here\n\nBefore you consider Montanaro UK Smaller Companies, you'll want to hear this.\n\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Montanaro UK Smaller Companies wasn't on the list.\n\nWhile Montanaro UK Smaller Companies currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys.\n\nView The Five Stocks Here"
    },
    {
        "title": "Ana de Armas, 36, steps out with boyfriend Manuel Anido Cuesta, 27, for a romantic stroll in Madrid after she enjoyed a night out with Tom Cruise",
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-14405455/Ana-Armas-Manuel-Anido-Cuesta-Valentines-night-Tom-Cruise.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
        "published_date": "2025-02-17T14:24:27+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Ana de Armas cosied up with her boyfriend Manuel Anido Cuesta as they enjoyed a stroll around Madrid on Monday.\n\nThe Cuban-born actress, 36, was seen linking arms with the lawyer, 27, as they enjoyed a hot drink together.\n\nFor their outing, Ana wore a brown padded leather biker coat which featured black detailing.\n\nOpting for comfort, the brunette paired he coat with loose-fitting black trousers and black trainers.\n\nMeanwhile Manuel, who is the stepson of Cuban President Miguel Díaz-Canel, wore a black padded coat and jeans.\n\nTheir outing comes just days after the actress was spotted out with Tom Cruise in Soho, London, for dinner together on Valentine's Day.\n\nAna de Armas, 36, cosied up with her boyfriend Manuel Anido Cuesta, 27, during a stroll in Madrid on Monday, after she was pictured during a Valentine's night out with Tom Cruise\n\nThe Cuban-born actress was seen linking arms with her lawyer partner as they enjoyed a hot drink, with Ana opting for a stylish brown leather jacket\n\nThe Mission Impossible star, 62, and Ana were mobbed by fans during their evening out and stopped to take pictures as a crowd formed around them.\n\nBefore her Valentine's Day outing, Ana was most seen kissing Manuel during a night on the town in Madrid, Spain, back in November.\n\nThe star locked lips with Manuel after they appeared to enjoy a dinner date together.\n\nThe romantic move appeared to indicate that Ana had ended her relationship with Tinder Vice President Paul Boukadakis, whom she began dating in the wake of her split from Ben Affleck.\n\nThe two looked loved-up on an after-dinner stroll, during which Ana locked arms with Manuel, who is an advisor to his father.\n\nBut their relationship has left some of her fans baffled because Ana fled communist Cuba when she was 18.\n\nSince going public with their romance, the Oscar nominee has been criticised by her compatriots and others who accuse her of dating the son of a dictatorship that she fled from.\n\nPresident Miguel was handpicked by former president Raúl Castro and 'chosen' in an election in which there were no opposition challengers allowed.\n\nFor their outing, Ana wore a brown padded leather biker coat which featured black detailing\n\nSince going public with their romance, the Oscar nominee has been criticised by her compatriots and others who accuse her of dating the son of a dictatorship that she fled from\n\nThe leader has overseen the collapse of Cuba's economy and continued the Castro doctrine that allows no opposition parties or protests against the ruling party.\n\nLike the Castros before him, he has been accused of overseeing massive human rights abuses.\n\nHe is Cuba's first leader in six decades not surnamed Castro, after Raúl went into semi-retirement following his stint as president.\n\nHe had taken over from his brother, Cuba's revolutionary leader Fidel Castro, in 2016.\n\nBut after she and Manuel were first spotted together in November, social media users were quick to express their baffled reactions.\n\nOne X user wrote: 'Ana de Armas left Cuba to pursue a career and life in America… just to end up dating the Cuban dictator's son… wtf?'\n\n'ana de armas is dating the stepson of the tyrant that runs the dictatorship she ran away from? this bad this is bad this is very bad.'\n\nTheir outing comes just days after the actress was spotted out with Tom in Soho, London, for dinner together on Valentine's Day\n\n'These images must travel the world, people must not have a mercy.\n\n'The famous actress Ana de Armas was photographed in Madrid with the Cuban genocidal Manuel Anido Cuesta, stepson of the dictator Díaz Canel and possible successor.\n\n'They are a couple. Murderers. Enjoying Madrid as if nothing was happening.'\n\nAna previously lived in Venice, California, but listed her home in 2020 while still dating Ben after they were relentlessly hounded by paparazzi."
    },
    {
        "title": "$102K BTC Price ‘Short Squeeze’? 5 Things To Know In Bitcoin This Week",
        "url": "https://theoptionsinsider.com/news-feed/102k-btc-price-short-squeeze-5-things-to-know-in-bitcoin-this-week/",
        "published_date": "2025-02-17T14:24:27+00:00",
        "source_name": "Unknown source",
        "author": "The Options Insider",
        "category": "general",
        "content": "Content could not be extracted."
    },
    {
        "title": "Paul McCartney’s ‘Abbey Road’ Medley to Close Out ‘SNL50’ Was the Perfect Nod to Chris Farley",
        "url": "https://americansongwriter.com/paul-mccartneys-abbey-road-medley-to-close-out-snl50-was-the-perfect-nod-to-chris-farley/",
        "published_date": "2025-02-17T14:23:58+00:00",
        "source_name": "Unknown source",
        "author": "Chris Piner",
        "category": "general",
        "content": "Although Saturday Night Live aired over the weekend, the episode marked a special occasion for the hit show. Marking the 50th anniversary, Lorne Michaels and the production made sure to make the night memorable. Wanting to pull out all the stops, the studio was packed with cast members and numerous celebrities. Among those who came out to celebrate SNL50 were Tina Fey, Jimmy Fallon, Amy Poehler, Bill Murray, and even Chevy Chase. But no episode of SNL would be complete without a musical guest. And there seemed no better way to end the show than with Paul McCartney performing a few hit songs from Abbey Road.\n\nVideos by American Songwriter\n\nIntroduced by Martin Short, McCartney shared his excitement with being on the stage during the historic moment. Over the last 50 years, the show welcomed countless stars to its stage. It even helped launch the careers of many comedians. Knowing how important the moment was, McCartney decided to cover hits like “Carry That Weight” and “The End.”\n\nOnline, fans loved the performance from McCartney, with comments reading, “The best part of this is that Paul actually sang it LIVE, without the use of AutoTune or any pitch correction. Sure, his voice is off-key and cracks a few times, but it’s real. Almost no big names are actually singing this genuinely anymore, and seeing an 82 year old man do it is incredible. Long live Macca.” Another fan shared a picture of McCartney with Chris Farley. And one person was just happy to still be alive to watch the singer perform, “What an honor to share time in this world with Paul McCartney. What an honor to still be able to watch him perform.”\n\nHaving Sir Paul McCartney perform the medley from Abbey Road is a fantastic callback to the Chris Farley Show! #SNL50 pic.twitter.com/Mx1AYAPMCc — TrueTalk (@TrueTalkA1) February 17, 2025\n\n[RELATED: 3 Legendary ‘Saturday Night Live’ Performances From the 1990s]\n\nFans Noticed One ‘SNL50’ Great Missing\n\nAlthough the studio was packed with guests, actors, and celebrities, many noticed that Dan Aykroyd skipped SNL50. While some wondered about his absence, Aykroyd shared on Twitter just days before the show, “Cracking a Head with pride at having been a co-founder of SNL along with everyone we were together with in those four years, five decades ago. This telecast is as historical as the next moon landing. Comedy stars of our age all gathered under the aegis of America’s greatest living impresario, my boss Lorne Michaels. People it’s friggin’ Holy!!”\n\nCracking a Head with pride at having been a co-founder of SNL along with everyone we were together with in those four years, five decades ago. This telecast is as historical as the next moon landing. Comedy stars of our age all gathered under the aegis of America’s greatest… — Dan Aykroyd (@dan_aykroyd) February 14, 2025\n\nWith 50 years already passed, SNL continues to move forward, embracing the future while sharing more than a few laughs.\n\n(Photo by Jo Hale/Redferns)"
    },
    {
        "title": "International exposure: New York journalists take Alicante by storm",
        "url": "https://euroweeklynews.com/2025/02/17/international-exposure-new-york-journalists-take-alicante-by-storm/",
        "published_date": "2025-02-17T14:23:46+00:00",
        "source_name": "Unknown source",
        "author": "Anna Ellis",
        "category": "general",
        "content": "It is often said that knowledge is power, and this is never more accurate than when you establish yourself as a foreign resident in a new country, like Spain. Being able to quickly familiarise yourself with the culture, rules, events, and customs can help ease the transition during a challenging time.\n\nThis is why Euro Weekly News makes it our mission to provide you with a free news resource in English that covers both regional and national Spanish news – anything that we feel you will benefit from knowing as you integrate into your new community and live your best life in Spain. In this way, you can forget about translating articles from Spanish into awkward English that probably don’t make much sense. Let us be your convenient and essential guide to all things that will likely affect you as a foreign resident living in Spain."
    },
    {
        "title": "Tara Davis-Woodhall Sends Emotional Message for Husband Hunter Woodhall as Couple Celebrates Olympian’s Birthday",
        "url": "https://www.essentiallysports.com/olympics-track-and-field-tara-davis-woodhall-sends-emotional-message-for-husband-hunter-woodhall-as-couple-celebrates-olympians-birthday/",
        "published_date": "2025-02-17T14:23:28+00:00",
        "source_name": "Unknown source",
        "author": "Dolly Bhamrick",
        "category": "sports",
        "content": "No matter how demanding life gets, a couple should always make time to celebrate the little moments. The power couple Tara Davis-Woodhall and her husband Hunter Woodhall seem to follow the same mantra. Whether it’s a grand milestone or a simple occasion, they’ve always made it a priority to cherish their love. And as another special day arrives, Tara sets out to make it unforgettable.\n\nTime after time, Tara decided to go above and beyond to make Hunter’s celebration very special. With an idea to make your loved ones happy, and only a little of the creativity that is needed, she came up with the surprise, which was just the right amount of their bond. Tara shared little details on the Instagram stories. One story shows how they started their trip, and the text tells everything. Caption?\n\nThe story is captioned with, “Surprised him with a trip to Legoland,” and “Happy early birthday to my honey.” It is a theme park based in California. Hunter is looking so happy in the story, and why not? Everyone loves surprises. What’s next? The next string of stories includes a happy Hunter, again with a cute message by Tara Davis-Woodhall, “Happy Birthday, boy on earth.” These cute messages by Tara to Hunter show how pure their bond is and also inspire other couples.\n\nADVERTISEMENT Article continues below this ad\n\nBut hang on, there is more to it. The Olympian couple enjoyed their time at Lego Land as they tried small, cute things and spent quality time together. The following Instagram story shows Hunter holding two custom LEGO figurines depicting a couple, with one figure having prosthetic running blades. In the background, smiling Tara can be seen. And Hunter seems to be very happy with the Legoland surprise. The string of celebrations doesn’t end there.\n\nHunter also shared a video story in which Tara can be seen happy and putting a LEGO design on a colorful LEGO wall. The wall features various pixel-style LEGO designs, including characters, symbols, and letters. The text overlay reads, “Best birthday ever. Thanks, lil mama.” That’s how Tara Davis-Woodhall and Hunter Woodhall spent the Olympian’s birthday together. Let’s rewind to how their journey started.\n\nTara Davis-Woodhall and Hunter Woodhall have come so far from track to forever\n\n“I don’t know why I have to do this, but I have to give you a hug.” That’s how the first time Davis approached Hunter after his race at a track meet in Pocatello, Idaho, in 2017. Tara Davis-Woodhall and Hunter Woodhall’s journey started that fine day. But they probably didn’t even know that they would be a married couple one day. This spontaneous gesture marked the start of their connection.\n\nDespite attending different universities—Tara at the University of Georgia and later the University of Texas, and Hunter at the University of Arkansas—they maintained a long-distance relationship, relying on communication and trust to navigate the challenges of their demanding athletic schedules.\n\nADVERTISEMENT Article continues below this ad\n\nTheir relationship deepened over the years, culminating in their marriage on October 16, 2022, at D’Vine Grace Vineyard in McKinney, Texas. This union not only solidified their bond but also strengthened their mutual support system as they pursued their athletic dreams. Their shared experiences and unwavering encouragement have been pivotal in their successes.\n\nIn the 2024 Paris Olympics, their combined dedication bore remarkable fruit. Tara clinched the gold medal in the women’s long jump with a leap of 7.10 meters, an achievement she celebrated by leaping into Hunter’s arms, creating one of the most memorable moments of the Games.\n\nADVERTISEMENT Article continues below this ad\n\nThe following month, Hunter secured his gold in the men’s 400-meter T62 race at the Paralympics, with Tara cheering him on from the stands. Their journey from a chance meeting to standing atop the Olympic podium exemplifies their resilience, love, and shared commitment to excellence. Aren’t they a cute couple? What do you think? Let us know in the comments below."
    },
    {
        "title": "Heavy Smoking and Stroke: New Study Links Unexplained Strokes in Younger Adults to Tobacco Use",
        "url": "https://www.greenprophet.com/2025/02/heavy-smoking-and-stroke-new-study-links-unexplained-strokes-in-younger-adults-to-tobacco-use/",
        "published_date": "2025-02-17T14:23:28+00:00",
        "source_name": "Unknown source",
        "author": "Karin Kloosterman",
        "category": "general",
        "content": "The dangers of smoking aren’t new—but emerging research is now pointing to a shocking link between heavy smoking and unexplained strokes in younger adults, especially men aged 45 to 49. A new study, published in the February issue of Neurology Open Access, suggests that smoking may be a hidden culprit behind cryptogenic strokes—strokes with no known cause—that strike seemingly healthy individuals long before their senior years. The study does not mention if cannabis smoking is also a factor.\n\nWhat Is a Cryptogenic Stroke?\n\nA cryptogenic stroke is a type of ischemic stroke, which occurs when a blockage disrupts blood flow to the brain. But here’s the catch: unlike typical strokes, the cause of these blockages remains a mystery. The symptoms—weakness, trouble speaking, and vision problems—can be devastating. While most strokes happen after age 65, researchers are now seeing an increase in younger people with these unexplained strokes.\n\n“While smoking has long been linked to ischemic stroke, little is known about how smoking affects people under 50, especially in those with unexplained stroke,” said Phillip Ferdinand, MBChB MRCP, of Keele University in the UK and a member of the American Academy of Neurology. “Recent research has shown an increase in younger people having these unexplained strokes, so it is important to evaluate any potential links. Our study found that smoking may be a key factor.”\n\nTo investigate, researchers analyzed 546 people aged 18 to 49 who had suffered an unexplained stroke, comparing them with 546 people of the same age and sex who had not. Participants answered questions about smoking habits, alcohol use, education level, physical activity, and other health conditions.\n\nThe Numbers Speak for Themselves\n\nAmong those who had an unexplained stroke, 33% were smokers, compared to just 15% in the control group.\n\nEven after adjusting for other stroke risk factors like alcohol use and blood pressure, researchers found that smokers had more than double the risk of unexplained stroke compared to non-smokers.\n\nThe risk was highest for men, who had more than three times the risk.\n\nThe danger spiked for people ages 45 to 49, who had nearly four times the risk.\n\nHeavy smoking—defined as more than 20 packs a year—led to an even greater risk: Heavy smokers faced a fourfold increase in unexplained stroke risk. Male heavy smokers saw nearly seven times the risk. Smokers aged 45 to 49 had nearly five times the risk.\n\n\n\nPublic Health Implications: Smoking Prevention Matters\n\nThe findings reinforce the need for stronger public health initiatives aimed at preventing smoking, especially heavy smoking, in younger adults. “Our findings suggest that continued public health efforts around preventing smoking, especially heavy smoking, may be an important way to help reduce the number of strokes happening to young people,” said Ferdinand.\n\nRelated: smoking shisha pipes may just be as bad as regular smoking\n\nThe study’s findings were primarily based on people of white European backgrounds, so additional research is needed to see if the results apply to other populations. However, the message is clear: quitting smoking, or better yet—never starting—could be a critical step in stroke prevention.\n\nIf you or someone you know smokes, consider this study another urgent reason to quit. Brain health is essential for longevity, and smoking is a risk factor that can be controlled. Explore more about stroke prevention and brain health at BrainandLife.org, where you’ll find expert-backed resources, podcasts, and guides on neurological wellness."
    },
    {
        "title": "Wall Street Brunch: Apple And Walmart Dominate Short Week",
        "url": "https://seekingalpha.com/article/4758992-wall-street-brunch-apple-and-walmart-dominate-short-week?source=feed_all_articles",
        "published_date": "2025-02-17T14:23:00+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Robert Way\n\nListen below or on the go on Apple Podcasts and Spotify\n\nNew Apple product seen, but no livestream keynote. (0:21) Walmart commentary on tariff impact expected. (0:48) Traders eye FOMC minutes. (2:21)\n\nThe following is an abridged transcript:\n\nFocus will be stock-specific this holiday-shortened trading week, with the economic calendar relatively light.\n\nTwo big household names will draw special attention: Apple (NASDAQ:AAPL) and Walmart (NYSE:WMT).\n\nOn Wednesday at noon ET, Apple will host a launch event. The announcement is expected to be conducted through a press release and promotional materials rather than a live-streamed keynote. A fourth-generation iPhone SE is widely expected to be featured , although there is speculation about a new MacBook Air, new iPad Air, or a surprise reveal.\n\nWalmart reports fiscal Q4 earnings before the bell on Thursday and investors will be anxious for any commentary about the impact of tariffs on China.\n\nAccording to SA Analyst Jeffrey Fischer, “Walmart concedes that a significant amount of merchandise is sourced internationally, but how much, and from where?”\n\n“Several online sources offered varied estimates, but all of them suggested that products from China represented well more than 50% of the items on North American Walmart shelves.”\n\nHe estimates a hit on EPS could potentially boost WMT’s P/E above 100x.\n\nAnalysts are forecasting a quarterly EPS of $0.65 on sales of nearly $179 billion. Revisions have been bearish in the last 90 days, though, with 18 downward revisions to EPS numbers compared to 9 upward revisions. On the top line there have been 11 upward revisions and 10 downward revisions.\n\nBut Seeking Alpha analyst Skeptical2 says: “Walmart should be able to accelerate earnings growth with increased share buybacks as cash flow continues to grow, and the company should continue to drive impressive growth regardless of economic cycles in what is likely to remain a favorable operating environment moving forward. Existing earnings estimates are likely low as well, since management has also consistently guided conservatively.”\n\nAlso on the earnings calendar:\n\nUFP Industries (UFPI), Noble (NE) and Transocean (RIG) report on Monday.\n\nOn Tuesday, Arista Networks (ANET), Medtronic (MDT), Cadence Design Systems (CDNS), Occidental Petroleum (OXY) and Vulcan Materials (VMC) issue numbers.\n\nHSBC Holdings (HSBC), Analog Devices (ADI), Carvana (CVNA) and Garmin (GRMN) weigh in on Wednesday.\n\nJoining Walmart on Thursday are Alibaba (BABA), Booking Holdings (BKNG), MercadoLibre (MELI) and Southern (SO).\n\nOn the economic front, the minutes from the last FOMC meeting arrive on Wednesday afternoon.\n\nAccording to veteran Fed watcher Mott Capital, who runs Reading the Markets Investing Group, the recent data point to a strong labor market and inflation rates that appear to be accelerating, with the market taking notice as 1-year and 2-year inflation swaps trade at their highest levels since March 2023.\n\n“The Fed minutes are likely to read moderately hawkish and carry the tone of the January press conference,” Mott Captial said. “The overall tone should indicate that the Fed wants to see more progress on inflation, but at the same time, send a message that the Fed believes the policy is restrictive.”\n\n“However, the data do not support that, nor do financial conditions. If that is the message of the minutes, it should lead to the bond market bear steepening resuming, as rates on the long-end of the yield continue to push higher.”\n\nMorgan Stanley economists say that Chairman Jay Powell's \"testimony in mid-February gave a more timely update on Fed thinking than the minutes will. Even so, we’ll look for assessments of recent disinflation, of potential effects from tariffs and policy uncertainty, and of the restrictiveness of current policy.\"\n\n\"Fed officials’ views on these differ, and the minutes may offer information about the distribution of their thinking,\" they said.\n\nIn the news this long weekend, OPEC+ is weighing yet another delay to its plan to unwind voluntary production cuts and resume monthly supply hikes from April, according to Bloomberg.\n\nIf it decides to push back the move, it'd be the fourth time that the Saudi Arabia-led oil producing alliance has delayed plans to restart production hikes since 2022.\n\nWhile a decision will likely be finalized in the coming weeks, the group is split on how to proceed. A delegate cited in the report said global oil markets continue to be too fragile to restart production.\n\nTencent (OTCPK:TCEHY) shares rose to their highest level since 2021 on Monday after the company said its WeChat messaging app has launched beta testing with Deepseek (DEEPSEEK), joining a growing list of Big Tech majors integrating DeepSeek’s AI software across China.\n\nAnd “Captain America: Brave New World” became the first big box office opening of the year, bringing in $88.5 million, according to studio estimates released Sunday.\n\nSony’s “Paddington in Peru” came in second with $13 million. The film opened in the UK in early November. Horror movie “Heart Eyes” came in third with $10 million during its second weekend. “Dog Man” came in fourth, and Chinese film “Ne Zha 2” came in fifth.\n\nFor income investors, Ford (F) and Johnson & Johnson (JNJ) go ex-dividend on Tuesday. Ford pays out on March 3 and J&J pays out on March 4.\n\nMicrosoft (MSFT) goes ex-dividend on Thursday, paying out on March 30. And Yum! Brands (YUM) goes ex-dividend on Friday, with a payout date of March 7.\n\nAnd in the Wall Street Research Corner, Citi Research analysts highlighted their Thematic 30 list of recommendations.\n\nThese are 30 stocks within three investing styles, including growth, cyclical, and defensive, and organized by several subsectors. The picks have outperformed the benchmark Russell 1000 (IWB) since Q4 last year.\n\nAmong the sectors are Artificial Intelligence, FinTech, Agricultural Demand, Global Tourism and Polution Solutions.\n\nTheir AI picks are: Amazon (AMZN), DoorDash (DASH), DocuSign (DOCU), Equinix (EQIX), GoDaddy (GDDY), Marvell Technology (MRVL) and Uber (UBER).\n\nEditor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks."
    },
    {
        "title": "3 Sneaky Good AI Stocks to Buy Now",
        "url": "https://247wallst.com/investing/2025/02/17/3-sneaky-good-ai-stocks-to-buy-now/",
        "published_date": "2025-02-17T14:23:00+00:00",
        "source_name": "Unknown source",
        "author": "Marc Guberti",
        "category": "general",
        "content": "Error: Page returned status code 403"
    }
]