[
    {
        "title": "Presidents Are Often Judged By History Through The Lens Of Morality",
        "url": "https://newsone.com/5939034/presidents-are-judged-by-history-through-the-lens-of-morality/",
        "published_date": "2025-02-17T14:33:46+00:00",
        "source_name": "Unknown source",
        "author": "George R. Goethals, University of Richmond",
        "category": "general",
        "content": "A statue of Abraham Lincoln, the 16th president of the United States, sits in the Lincoln Memorial in Washington. Historians consistently have given Lincoln, the Great Emancipator, their highest rating because of his leadership during the Civil War. Jakub Porzycki/NurPhoto via Getty Images\n\nWhat will be former President Joe Biden’s legacy? How will Americans in the future consider his four years in office?\n\nEvery American president lands in the history books. And historians’ assessments of their performance have been generally consistent over time. But some presidents’ rankings have changed as the nation – and historians themselves – reassessed the country’s values and priorities.\n\nHistorians have been ranking presidents in surveys since Arthur Schlesinger Sr.’s first such study appeared in Life magazine in 1948. The results of that survey categorized Presidents Abraham Lincoln, George Washington, Franklin D. Roosevelt, Woodrow Wilson, Thomas Jefferson and Andrew Jackson as “great.”\n\nAt the other end of the ranking, Presidents Ulysses S. Grant and Warren Harding were labeled “failure.”\n\nThere have been numerous surveys ranking presidents since then, including a 1962 survey by Arthur Schlesinger Jr., which showed Jackson dropping into a “near great” category.\n\nChanging views shift rankings\n\nWhile the surveys point to Americans’ evolving social attitudes, with implications for our electoral politics and governance, they don’t always ask historians the same questions. Some simply ask them to rank presidents. Others ask them to also judge specific aspects of leadership, such as economic policy or international diplomacy.\n\nDespite the relative stability of the ratings across surveys – especially at the top, where Lincoln, Washington and Roosevelt consistently hold sway – there have been some dramatic changes. C-SPAN’s four surveys on presidential leadership, for example, show some shifts in historians’ ranking of presidents over time.\n\nSince 2000, the cable network has polled prominent historians every time there has been a change in administrations. So, C-SPAN conducted surveys in 2009, 2017 and 2021 as well. The 2025 survey, which will assess Biden’s presidency, is in the works.\n\nThe surveys offer not only an overall ranking of presidents but also rankings in each of the following 10 categories: public persuasion, crisis leadership, economic management, moral authority, international relations, administrative skills, relations with Congress, vision and agenda setting, pursuance of equal justice for all, and performance within the context of the times.\n\nWhile Lincoln has ranked at the top of each survey, the two presidents who served right before him – Franklin Pierce and James Buchanan, both sympathetic to slavery – and his immediate successor, white supremacist Andrew Johnson, have consistently ranked at the bottom.\n\nDonald Trump debuted in C-SPAN’s 2021 survey near the bottom, ranked 41st of 45 presidents. The rating for his first term, from 2017 to 2021, could change in the 2025 survey; his current presidency will be assessed after he leaves office.\n\nThe Print Collector/Hulton Archive via Getty Images\n\nWhat is a good leader?\n\nAs a social psychologist and leadership scholar at the University of Richmond’s Jepson School of Leadership Studies, with long-standing interests in presidential leadership, I believe these surveys can be best understood in terms of psychologist Dean Keith Simonton’s model of evaluating presidents.\n\nHe maintains that historians generally view leaders, including presidents, positively to the extent that they fit a deeply ingrained image of someone who is strong, active and good. And that image comes to mind when they think of attributes and events linked to a president that suggest he was a good leader. Examples include how long he served, whether he was a war hero and whether he was assassinated, and in that sense, was a martyr.\n\nOn the other hand, historians also easily recall scandals, such as Richard Nixon’s Watergate and Harding’s Teapot Dome. These detract from these presidents’ “good” image, as evidenced by Nixon’s and Harding’s rankings of 31st and 37th, respectively, in C-SPAN’s 2021 survey.\n\nRace matters\n\nIn recent years, presidents’ positions on race and racism have been important factors in historians’ evaluations of their records. For example, Wilson’s rather startling efforts to segregate federal offices and the military are becoming more widely known as scholars explore that aspect of his presidency.\n\nHis actions in that regard may overshadow his international idealism, which favored morality over materialism and has been viewed positively. He is no longer considered one of our “great” presidents. In Schlesinger Sr.’s 1948 survey, he ranked fourth of 29 presidents. But in 2021, historians ranked him 13th of 45 for C-SPAN.\n\nJackson dropped the most in C-SPAN’s surveys, from 13th in 2000 to 22nd in 2021. His commitment to Indian removal from Southern and Midwestern states, not unique for the time, and the resulting Trail of Tears – the forced and violent relocation of Native Americans from their homelands – are important topics in today’s political discussions.\n\nSeveral other presidents who lost ground, including James Polk, Zachary Taylor, Rutherford B. Hayes and Grover Cleveland, were associated with efforts to extend slavery or with failure to protect African Americans following Reconstruction.\n\nThen there is the case of Grant. Ranked at the bottom as a failure in the mid-20th century, he had the largest ranking change of any president in the C-SPAN surveys. He jumped 13 places from 33rd in 2000 to 20th in 2021. He had already moved up from second-to-last place in the 1948 and 1962 Schlesinger surveys to somewhere in the bottom quartile in 2000, to a position in 2021 where more presidents ranked worse than he did.\n\nThe 2021 C-SPAN survey ranks Grant sixth on “pursued equal justice for all,” behind only Lincoln, Lyndon Johnson, Barack Obama, Harry Truman and Jimmy Carter. Given the centrality of equal justice, which may overshadow whatever connection Grant may have had to scandals in his administration, such as Crédit Mobilier and the Whiskey Ring, Grant rises in historians’ overall evaluation.\n\nMoral authority\n\nThis all suggests historians have quite simple ways of evaluating presidents. We have an image of the ideal leader.\n\nPrint Collector/Hulton Archive via Getty Images\n\nJust a few pieces of information relating to that ideal make a big difference in whether we view presidents as fitting or not fitting that image. This is particularly true of our perception of how good they were. Presidents’ moral commitments speak loudly to whether or not we view them as good.\n\nInterestingly, on the quality of “moral authority” in the C-SPAN surveys from 2000 to 2021, Grant’s ranking rose 14 rungs, from 31st to 17th, even more than it did on “pursued equal justice for all,” where it rose 12 rungs, from 18th to sixth. Wilson and Jackson dropped 13 and 18 places, respectively, on “moral authority.”\n\nClearly, moral judgments loom large in historians’ assessments of presidential leadership.\n\nEditor’s note: This story has been updated to reflect the 2025 transfer of power from President Biden to President Trump.\n\nGeorge R. Goethals, Professor in Leadership Studies, University of Richmond\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article."
    },
    {
        "title": "The Prince and Princess of Wales' £33k-per-week Mustique villa has a 60ft pool",
        "url": "https://www.hellomagazine.com/travel/814676/kate-middleton-prince-william-villa-antilles-mustique/",
        "published_date": "2025-02-17T14:33:35+00:00",
        "source_name": "Unknown source",
        "author": "Georgia Brown",
        "category": "general",
        "content": "Error: Page returned status code 404"
    },
    {
        "title": "Scottish museum to undergo 'bold transformation' after £2.6m government funding boost",
        "url": "https://www.scotsman.com/news/scottish-news/scottish-museum-to-undergo-bold-transformation-after-ps26m-government-funding-boost-4994958",
        "published_date": "2025-02-17T14:32:22+00:00",
        "source_name": "Unknown source",
        "author": "Jane Bradley",
        "category": "general",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "The Lathums bring forward release of new album ‘Matter Does Not Define’",
        "url": "https://www.nme.com/news/music/the-lathums-bring-forward-release-of-new-album-matter-does-not-define-3838653?utm_source=rss&utm_medium=rss&utm_campaign=the-lathums-bring-forward-release-of-new-album-matter-does-not-define",
        "published_date": "2025-02-17T14:32:14+00:00",
        "source_name": "Unknown source",
        "author": "Laura Molloy",
        "category": "general",
        "content": "The Lathums have brought forward the release of their new album ‘Matter Does Not Define’.\n\nThe Wigan rock band’s third album was initially due to be released on March 7, but will now come out February 28 after they “pulled a lot of strings”.\n\nAdvertisement\n\nSharing the news on Instagram, they wrote: “MDND IS COMING A WEEK EARLY! ❤️‍🔥 We’ve pulled some (a lot 😅) of strings, and now, our new album will be out Friday 28 February—just over two weeks away. 😎 We couldn’t be more excited for you to hear it.\n\n“Huge thanks to everyone who’s pre-saved & ordered from the store—you’ll be getting the album a whole week sooner! That also means extra time to learn the lyrics before the tour… so no excuses.”\n\nThey gave fans the first taste of their yet-to-be-released third album last summer with the single ‘No Direction’, marking their first new music since the release of their 2023 album ‘From Nothing To A Little Bit More’ – which saw them earn their second Number One LP in the UK album charts – and their standalone single ‘Thoughts Of A Child’ which was shared last October.\n\nFrontman Alex Moore said in a press release that recording the LP “felt like coming full circle”. “We worked on it with our good friend and old college tutor, John Kettle, which brought us back to our roots. The process felt organic, without the pressure to cater to industry demands, and it allowed us to really explore creatively,” he said.\n\nRecommended\n\n“It was like being back in college, free to make music without constraints. Like, [drummer Ryan Durrans] Duz even plays a frying pan in ‘Stellar Cast’, a random touch you might not expect. Album three is real, raw, and everything we hoped it would be.”\n\nShortly after the album’s release, the band will be heading out on a UK and Ireland tour, set to kick off in Glasgow on March 13. From there, they’ll head to Newcastle, Stoke, Sheffield, London, Belfast, Dublin and more. Then, they’ll wrap things up with a hometown gig at Manchester’s O2 Apollo on April 11.\n\nTickets are on sale now and you can get yours here.\n\nThe Lathums’ 2025 UK tour dates are:\n\nMARCH\n\n13 – Barrowland Ballroom, Glasgow\n\n15 – NX Newcastle, Newcastle\n\n17 – Victoria Hall, Stoke\n\n18 – Octagon, Sheffield\n\n20 – Rock City, Nottingham\n\n21 – O2 Academy, Birmingham\n\n22 – O2 Academy Brixton, London\n\n24 – O2 Guildhall, Southhampton\n\n25 – SWX, Bristol\n\n27 – Limelight, Belfast\n\n28 – The Academy, Dublin\n\n\n\nAdvertisement\n\nAPRIL\n\n11 – O2 Apollo, Manchester\n\nThey’re also set to play TRNSMT Festival later this summer, as well as Neighbourhood Weekender.\n\nThe Lathums spoke to NME ahead of the release of their last album ‘From Nothing To A Little Bit More’ last year. Moore said at the time: “What’s the point in putting so much into something that you’re not genuinely passionate about? I think it’s quite refreshing that people can see that there’s genuine feelings behind these songs, not like a lot of music that’s out nowadays that’s got no emotion or substance behind it. You can tell those people are singing about what they think people want [to hear]. But I don’t give you what you want: I give you what you need.”"
    },
    {
        "title": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash",
        "url": "https://www.toledoblade.com/news/nation/2025/02/17/trump-begins-firings-of-faa-air-traffic-control-staff-after-fatal-dc-plane-crash/stories/20250217084",
        "published_date": "2025-02-17T14:31:22+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "Enter-To-Win\nObituaries\nEvents\nJobs\nClassifieds\nMENU\nSUBSCRIBE\nLOGIN\nREGISTER\nLOG OUT\nMY PROFILE\nNEWSLETTERS\nMENU\nACCOUNT\nSubscribe\nLogin\nRegister\nLog out\nMy Profile\nSubscriber Services\nSearch\nSECTIONS\nHOME\nHomepage\nLOCAL\nLocal Home\nAnimals\nCity\nCourts\nCommunity Events\nDaily Log\nDogs for Adoption\nEducation\nEnvironment\nHomicides\nPolice Fire\nPolitics\nSchool Closings\nSuburbs\nTransportation\nNEWS\nNews Home\nDeaths\nMedical\nNation\nReligion\nWorld\nSPORTS\nSports Home\nAmateur\nBGSU\nBrowns\nCavaliers\nCollege\nDana Open\nGolf\nGuardians\nHigh School\nLions\nLourdes\nMichigan\nMud Hens\nOhio State\nOutdoors\nOwens\nPistons\nPro\nRed Wings\nTigers\nUT\nWalleye\nA&E\nA&E Home\nArt\nCulture\nFood\nGardening\nLiving\nMovies\nMusic, Theater, & Dance\nPeach Weekender\nRestaurant Reviews\nToledo Magazine\nTV & Radio\nBUSINESS\nBusiness Home\nAgriculture\nAutomotive\nDevelopment\nEnergy\nLabor\nPersonal Finance\nReal Estate\nRestaurant\nRetail\nStock Market\nTechnology\nOPINION\nOpinion Home\nColumnists\nEditorial Cartoons\nEditorials\nKeith Burris\nLetters to the Editor\nSubmit a Letter\nHEALTH & WELL-BEING\nHealth & Well-Being Home\nB PARTNERS\nB Partners Home\nAbility Center\nArrowhead Behavioral\nBalance & Mobility\nBGSU\nBlack Diamond\nBlue Ribbon Hemp\nBolt Express\nBoyk Law Offices\nCASA\nEpworth Church\nExciting Windows by Couture\nFair Housing Center\nFinixio\nFulton Cty Health Center\nGlass City Academy\nGTCF\nHammill Medical\nHoliday Gift Guide\nHomes\nHOPE Toledo\nHylant\nImagination Station\nJustCBD\nKapios\nKeystone\nKids of Character\nLa-Z-Boy\nLeadership Toledo\nLevis Commons\nLourdes University\nLucas County Recorder\nLuther Home of Mercy\nMcLaren St. Luke's\nMed1Care\nMighty Earth\nMinistry of Hemp\nMission Lean\nMVCDS\nOhioans Home Healthcare\nOSU Engineering\nOswald Companies\nPhoenix Investors\nProMedica\nProMedica Medical Mgmt\nReaders' Choice Awards\nRestaurants\nRonald McDonald House\nShumaker\nSolheim Cup\nSpengler Nathanson\nTARTA\nTernion\nToledo Clinic\nToledo Museum of Art\nToledo Public Library\nUnited Way\nUniversity of Toledo\nUT Physicians\nUTMC\nUSA Insulation\nZenobia Shriners\nMEALS WITH MADDIE\nMeals with Maddie Home\nOTHER\nEBLADE\nENTER-TO-WIN\nBLADE REWARDS\nBLADE VAULT / REPRINTS\nCLASSIFIEDS\nOBITUARIES\nJOBS\nCLASSIFIEDS\nBLADE HOMES\nHOMES\nWEEKLY ADS\nEVENTS\nCONTACT US / FAQ\nCONTACT US\nSUBSCRIBER GUIDE\nADVERTISING\nCAREER OPPORTUNITIES\n&nbsp\n&nbsp\nTOP"
    },
    {
        "title": "“Time will come”: Carlos Alcaraz Opens Up About the Surprising Reason He’s Grown Apart from His Idol Rafael Nadal",
        "url": "https://www.essentiallysports.com/atp-tennis-news-time-will-come-carlos-alcaraz-opens-up-about-the-surprising-reason-hes-grown-apart-from-his-idol-rafael-nadal/",
        "published_date": "2025-02-17T14:31:17+00:00",
        "source_name": "Unknown source",
        "author": "Aarav Singh Gill",
        "category": "sports",
        "content": "It’s never easy to bid farewell to your childhood idol. When Carlos Alcaraz emotionally thanked Spanish legend Rafael Nadal “for being an inspiration to all of us,” tears rolled the inner him just to see the 22-time Slam winner drift apart from the sport he gave everything to for nearly two decades. The ‘King of Clay’ played the final match of his illustrious career representing Spain at the Davis Cup Final 8 in Malaga in November last year. However, since his departure, Alcaraz hasn’t been in contact with him. The reason?\n\nHaving dedicated his life on the court and following a hectic tour-level calendar, naturally, left little to no personal time for Rafa. But, his retirement meant he could now finally reap the rewards of his years-long hard work and, Alcaraz respected that. During a conversation with the Spanish publication, ‘Sport’, the 21-year-old spoke about his dynamic with the former World No. 1 and acknowledged the well-deserved break relished by Nadal, before commencing his Qatar Open campaign.\n\n“Rafa and I have a very good relationship, but I haven’t spoken to him again since he retired from the Davis Cup. I think he deserves to be at peace with his family and enjoying the things that he couldn’t enjoy when he was playing,” he said. “He has been and is a great role model for me. I have seen that he has congratulated me on social media, but I have not yet had the chance to speak to him. I am sure that the time will come when I can do so.”\n\nADVERTISEMENT Article continues below this ad\n\nThe former World No. 1, marred with injury concerns ever since sustaining a hip injury at the 2022 Australian Open, struggled to restore his A-game on the tour. Moreover, his valiant effort to clinch a final gold medal for his nation at the Paris Olympics in 2024 also came crashing after he suffered a premature exit at the quadrennial event.\n\nBefore Nadal drew the curtain on his career in front of his home crowd in Malaga, Alcaraz hoped to bid him farewell in the most fitting way. “No player deserves more to finish the incredible career he had with a title, and I know how special the Davis Cup is for him. It will be a difficult challenge but winning it for Rafa is a huge motivation.” Life post-retirement has been full of business commitments for Rafa.\n\nJust days ago, reports showed fans that the Spanish icon sold nearly half his stake (44.9%) in his ‘Rafa Nadal Academy’ to a private investment company GPF for a lucrative $100M profit. Moreover, Nadal hasn’t appeared as a spectator at any tennis events since retirement. As for Alcaraz, the 21-year-old has his sights set on the big task.\n\nADVERTISEMENT Article continues below this ad\n\nCarlos Alcaraz on climbing the ATP ranking ladder – “Number one is always a goal”\n\nDoors to claiming the World No. 1 spot were just opened for players. And, that’s an opportunity Spanish superstar Carlos Alcaraz won’t sleep on. The ATP ranking leader, Jannik Sinner, recently accepted a three-month doping suspension from the tour after coming to an agreement with WADA to seal his long-drawn doping controversy.\n\nThe Italian sensation twice tested positive for a banned substance in March last year, drawing acute backlash from the community. However, his absence means that arch-rival Alcaraz can regain his lost spot.\n\nADVERTISEMENT Article continues below this ad\n\nTalking in the same interview, Alcaraz, although refrained from talking about Sinner’s doping saga – “The truth is little to say. Whether it is or not, it does not influence us. We remain focused on ours and our goals” – talked about reclaiming the World No. 1 spot. “The number one is always a goal. As I say, that it’s not there doesn’t change anything for us. We try to improve in our own and focus on continuing to work to reach number one.”\n\nAlcaraz will next take to the court on Monday, February 17. The top-seeded player is slated to lock horns with Marin Cilic in the Middle Eastern event’s Round of 32."
    },
    {
        "title": "Patriots predicted to swing blockbuster trade for $94 million Steelers star",
        "url": "https://www.sportingnews.com/us/nfl/new-england-patriots/news/patriots-predicted-swing-blockbuster-trade-94-million-steelers-star-george-pickens/f5e243658f1487cb957d7620",
        "published_date": "2025-02-17T14:31:16+00:00",
        "source_name": "Unknown source",
        "author": "Aaliyan Mohammed",
        "category": "sports",
        "content": "The New England Patriots will prioritize finding weapons for Drake Maye this offseason. They could land a young star through a trade with an AFC North team.\n\nThe Pittsburgh Steelers will have to decide who their quarterback is going forward and the uncertainty could lead to George Pickens wanting a change of scenery. Pickens has 2,841 yards and 12 touchdowns in three seasons with the Steelers. He has been vocal about targets and could be a trade candidate this offseason. Sportsnaut's Andrew Buller-Russ predicted the Patriots would trade for Pickens this offseason.\n\n\"The Patriots have a couple of young receivers in development, but Drake Maye is ready to produce now,\" wrote Buller-Russ. \"Meanwhile, the Steelers have had some internal issues with George Pickens and now he’s eligible for an extension. Pittsburgh could prefer to capitalize on Pickens’ trade value and New England would probably appreciate adding a target who can be a bonafide WR1.\"\n\nMike Vrabel has shown the ability to deal with an outspoken receiver in the past. He coached A.J. Brown for three seasons on the Titans. Pickens is projected to earn a four-year, $94 million deal as a free agent. He is in the final year of his rookie deal and could be a great addition for Maye in New England.\n\nHe already has a 1,000-yard season under his belt and had 900 yards last season despite missing three games and inconsistent quarterback play.\n\nMore NFL: Patriots, Eagles blockbuster trade proposal would bring $96 million superstar to NE"
    },
    {
        "title": "Diktaean Cave Still Closed: Accessibility Upgrades and Delays Explained",
        "url": "https://www.argophilia.com/news/diktaean-cave-still-closed/240400/",
        "published_date": "2025-02-17T14:30:41+00:00",
        "source_name": "Unknown source",
        "author": "Manuel Santos",
        "category": "general",
        "content": "The Diktaean Cave, a significant tourist site in Crete, remains inaccessible.\n\nPlans to add a lift, improve infrastructure, and update facilities are in motion.\n\nAccessibility for disabled visitors is a primary focus, but progress is slow.\n\nThe large-scale project includes trail restoration, parking changes, and enhanced visitor experiences.\n\nDespite approvals and funding, no completion date is set.\n\nAs we announced in 2024, the Diktaean Cave is closed to the public and will remain inaccessible in the summer of 2025. Officials assure everyone that the wheels are turning, but if this pace gets any slower, they may need an archaeological dig themselves to find the completed project.\n\nPlan of the redevelopment of Europe Square (Photo: Ministry of Culture ΥΠΠΟ)\n\nΕπιτάχυνση διαδικασιών για την κατασκευή του αναβατορίου και την αναβάθμιση των υποδομών στο Δικταίο Άντρο\n\nA Much-Needed Overhaul\n\nThe cave, steeped in mythology as the birthplace of Zeus (yes, that Zeus), has long drawn in crowds—but for many, reaching it is an uphill battle. The plan—a million-euro blockbuster of a project—is ambitious. The project is financed by the Ministry of Culture with approximately 16,000,000 euros from the Recovery Fund. Highlights include:\n\nInstallation of a hillside lift from Europe Square up to the cave entrance, making it accessible for mobility-impaired visitors.\n\nfrom Europe Square up to the cave entrance, making it accessible for mobility-impaired visitors. Reinforcement of rocky slopes inside the cave for safety.\n\ninside the cave for safety. Upgraded lighting for better visibility, or perhaps so you can glare at your guide when they tell you it’s still “under construction.”\n\nfor better visibility, or perhaps so you can glare at your guide when they tell you it’s still “under construction.” Revamping Europe Square , complete with new paths, sitting areas, and fewer potholes disguised as “character.”\n\n, complete with new paths, sitting areas, and fewer potholes disguised as “character.” Restoration of stone trails leading to and from the cave because visitors really don’t dream of twisting an ankle.\n\nleading to and from the cave because visitors really don’t dream of twisting an ankle. New parking arrangements, finally moving spaces away from the footpaths they currently dominate.\n\nView of the Diktaion Andros slope lift at the starting point (Photo: Ministry of Culture ΥΠΠΟ)\n\nIf there’s anything Greece loves more than backed-up construction timelines, it’s more studies and permits. The Central Archaeological Council has waved through the plans, while Development Organization “Daedalos SA” is handling the heavy lifting (figuratively—for now). The Ministry of Culture threw €16 million from recovery fund money into the works. However, the cave is still… well, very closed.\n\nMythology Meets Red Tape\n\nBack in September 2024, Greece’s Culture Minister, Lina Mendoni, took the mic to remind everyone of the cave’s rich heritage and, naturally, to address the why-is-this-taking-so-long crowd. “This is a globally significant site tied to legends of Zeus and Europe’s sneaky seduction under a plane tree.” Sounds lovely, doesn’t it? Except for one little snag: the area is practically impossible to reach for anyone not in peak physical condition or those requiring specialized access.\n\nMendoni waxed poetic about the cave’s potential after the upgrades—calling it an “irreplaceable cultural asset” once the lift is installed. Until then, let’s be honest: it’s just eye sore standing behind no-entry tape.\n\nHere’s what’s promised when the changes are completed:\n\nImproved accessibility for all, in line with a “universal access” initiative.\n\nConservation work to return the cave to its former Neolithic-era glory.\n\nA safer, modernized space offering a comfortable journey to explore its historical depth (finally).\n\nFor now, though, visitors can look forward to hiking busted trails while squinting at posted signs stating, “renovations in progress.”"
    },
    {
        "title": "TNA Impact preview: The lineup for Thursday’s live show (Full Sail reports needed)",
        "url": "https://prowrestling.net/site/2025/02/17/tna-impact-preview-the-lineup-for-thursdays-live-show-full-sail-reports-needed-2/",
        "published_date": "2025-02-17T14:30:40+00:00",
        "source_name": "Unknown source",
        "author": "Jason Powell",
        "category": "general",
        "content": "CategoriesImpact News\n\nBy Jason Powell, ProWrestling.net Editor (@prowrestlingnet)\n\nTNA is advertising the following matches and events for Thursday’s TNA Impact television show.\n\n-TNA World Champion Joe Hendry in concert\n\n-“The Rascalz” Trey Miguel and Zachary Wentz vs. Tyson Dupont and Tyriek Igwe\n\n-JDC vs. Leon Slater in a No DQ match\n\n-Tessa Blanchard ordered to wrestle by Santino Marella\n\nPowell’s POV: Impact will be live on Thursday from Orlando, Florida at Full Sail University. The company will also tape future television shows on Friday. We are looking for reports or basic results via dotnetjason@gmail.com.\n\nTNA Impact is simulcast Thursdays on AXS TV and TNA+ at 7CT/8ET. John Moore’s weekly TNA Impact reviews are typically available on Fridays, along with my audio reviews for Dot Net Members (including our Patreon patrons), but we may have live coverage due to this show airing live."
    }
]