[
    {
        "title": "Ryan Ruocco pokes fun at Rebecca Lobo after Paige Bueckers’ all-time UConn move",
        "url": "https://awfulannouncing.com/espn/ryan-ruocco-rebecca-lobo-paige-bueckers-all-time-uconn.html",
        "published_date": "2025-02-17T15:30:58+00:00",
        "source_name": "Unknown source",
        "author": "Sean Keeley",
        "category": "general",
        "content": "Credit: ESPN\n\nThe Uconn Huskies women’s basketball team made history Sunday, ending the South Carolina Gamecocks’ 71-game home win streak.\n\nUConn star Paige Bueckers also made a notable individual leap during the game, moving to No. 11 on UConn’s all-time scoring list. It just so happened that the person she passed was calling the game for ESPN.\n\nUConn legend Rebecca Lobo was on the call alongside Ryan Ruocco. They had front-row seats to see Bueckers hit the shot that moved her past Lobo, a moment Ruocco was happy to poke fun at his broadcasting partner about.\n\n“Sorry, partner! Paige Bueckers just blowin’ by ya!” – Ryan Ruocco to Rebecca Lobo as Bueckers moves ahead of her on the UConn all-time scoring list 🏀🎙️ pic.twitter.com/qhwXMRqIRz — Awful Announcing (@awfulannouncing) February 16, 2025\n\n“Sorry, partner! Paige Bueckers just blowin’ by ya!” Ruocco chided Lobo as a graphic showed Bueckers’ placement above her.\n\n“I made the list, Ryan!” said a laughing Lobo. “Congratulations to Paige Bueckers.”\n\nThe Huskies used a vintage performance in their 87-58 defeat of the defending national champions. While that kind of result was commonplace in Lobo’s day, UConn has lurked in South Carolina’s shadows in recent seasons. The game sends the signal that the tide might be turning once more.\n\nWhile Bueckers will likely rise a few more spots on that scoring list before she leaves Storrs, she’s got some work to do to catch up with Lobo in some other categories. Specifically, Lobo led the 1995 Huskies to an undefeated national title in 1995, winning almost every player of the year award."
    },
    {
        "title": "Montgomery woman wanted on felony warrants for bank fraud",
        "url": "https://www.waka.com/2025/02/17/montgomery-woman-wanted-on-felony-warrants-for-bank-fraud/",
        "published_date": "2025-02-17T15:30:51+00:00",
        "source_name": "Unknown source",
        "author": "Josh Rainey",
        "category": "general",
        "content": "by WAKA Action 8 News\n\nA Montgomery woman is wanted for bank fraud.\n\nThe U.S. Postal Inspection Service is offering a reward of up to $100,000 for information leading to the arrest and conviction of Rhashema Shantae Shackleford AKA “Rhashema S. Deramus”.\n\nDetails were not made available, but investigators say Shackleford is wanted on outstanding felony warrants for bank fraud and conspiracy to commit mail and bank fraud.\n\nIf you have any information about this case, please contact Central Alabama Crimestoppers or the U.S. Postal Inspection Service at 877-876-2455\n\nIf you have any information regarding the whereabouts of Rhashema Shantae, please call the Montgomery Police Department or Central Alabama CrimeStoppers at 334-215-STOP."
    },
    {
        "title": "A top Chinese official tours Thai-Myanmar border to highlight crackdown on scam centers",
        "url": "https://winnipegsun.com/pmn/a-top-chinese-official-tours-thai-myanmar-border-to-highlight-crackdown-on-scam-centers",
        "published_date": "2025-02-17T15:30:51+00:00",
        "source_name": "Unknown source",
        "author": "Associated Press",
        "category": "general",
        "content": "Error extracting content: Article `download()` failed with 403 Client Error: Forbidden for url: https://winnipegsun.com/pmn/a-top-chinese-official-tours-thai-myanmar-border-to-highlight-crackdown-on-scam-centers on URL https://winnipegsun.com/pmn/a-top-chinese-official-tours-thai-myanmar-border-to-highlight-crackdown-on-scam-centers"
    },
    {
        "title": "Ilia Topuria Backs Jon Jones in Bold Stance on Highly-Anticipated Tom Aspinall Fight",
        "url": "https://www.essentiallysports.com/ufc-mma-news-ilia-topuria-backs-jon-jones-in-bold-stance-on-highly-anticipated-tom-aspinall-fight/",
        "published_date": "2025-02-17T15:30:42+00:00",
        "source_name": "Unknown source",
        "author": "Anirban Chatterjee",
        "category": "sports",
        "content": "In the UFC world, there’s always that one fight which proves to be elusive enough to keep fans on the edge. Previously, it was Khabib Nurmagomedov vs. Tony Ferguson, which, heartbreakingly didn’t come into fruition, despite being booked five times. However, in that situation, both fighters actually wanted to face each other, without fear of losing and wanting to prove once and for all who the better fighter was. Now, we have a similar fight, except this time, two things are different. One, it’s a veteran vs. up-and-comer fight. Two, one of these fighters is reluctant to face the other. We’re talking about Jon Jones vs. Tom Aspinall, of course.\n\nMeanwhile, frustration among fans has boiled over into outright hostility, with many accusing the MMA legend of dodging the new wave of challengers—especially the dangerous Brit waiting in the wings. According to featherweight champion Ilia Topuria, however, the fight will definitely happen. ‘El Matador’ recently sat down for a chat on the Full Send podcast and shared his honest opinion on the whole scenario. For a potential fight with Aspinall, ‘Bones’ wants “f**k you money” and Topuria feels he deserves to get paid big money.\n\nDuring the interview, the host of the show asked the champion, “You think the Jon Jones versus Aspinall fight happens?” Topuria had no hesitation in saying, “For sure”. He then pointed out that ‘Bones’ is correct in asking big money for his fight and that the UFC should oblige him.\n\nADVERTISEMENT Article continues below this ad\n\nHe said, “He don’t need to fight anymore you know. If he fights, he’s honest, like, ‘This is what I need to go inside that Octagon and put the performance you want from my side. If you are willing to pay me just pay me. If not god bless you we’re all good’. ” As fans, we can only hope that the UFC is doing everything in their power to make this fight happen. After all, Dana White did say that this would be “the biggest fight in UFC history”, if it happened.\n\nView this post on Instagram A post shared by Full Send Podcast (@fullsendpodcast)\n\nEarlier this month, the Albuquerque native stirred excitement by teasing his “next fight.” But when the reveal came, it wasn’t the long-awaited showdown fans had hoped for—instead, it was a campaign about the “health care system”, advocating for patient rights for a non-profit organization. But that doesn’t mean Jones isn’t warm to the idea of facing Aspinall. We’re saying this because of a certain reaction Jones gave about a certain fight announcement. Let’s take a closer look.\n\nJon Jones likes the idea of him fighting Tom Aspinall next in his career\n\nADVERTISEMENT Article continues below this ad\n\nThe heavyweight division is stuck in limbo, and at the center of it all is Jon Jones—a man who knows how to keep the MMA world hanging on his every word. However, UFC CEO Dana White is confident that he can pull off what could be a super fight in the heavyweight division.\n\nThe most recent official update came last month when the 55-year-old said, “One hundred percent, if we don’t get the fight done, we move on and make another fight…We’re working on lots of stuff right now. There’s lots of really good sh*t going on right now. There’s no situation. It’s the biggest fight we can make.” Although the last official word from the UFC was vague, an Instagram MMA page called Elusive Combat has now hinted at a possible announcement.\n\nThe message read, “Breaking: Jon Jones vs. Tom Aspinall is in the works for UFC 317 during International Fight Week.” The source mentioned Dana White, but there is a lot of doubt surrounding the post. However, Jones caught the attention of the post and commented, “How cool would that be?”—which has now added more fuel to the ongoing speculation.\n\nADVERTISEMENT Article continues below this ad\n\nAs far as the UFC 317 event is concerned it is reported that it will take place on June 28 at the T-Mobile Arena in Nevada. The heavyweight champion has once kept the fans on their toes with his latest comment. It will now be interesting to see whether the UFC can make the fight between these two happen or not.\n\nDo you think Jon Jones will fight Tom Aspinall next in his career? Let us know your thoughts in the comments below."
    },
    {
        "title": "The NBA All-Star verdicts are in, and the player reaction to the mini-tournament is mixed",
        "url": "https://torontosun.com/sports/basketball/the-nba-all-star-verdicts-are-in-and-the-player-reaction-to-the-mini-tournament-is-mixed",
        "published_date": "2025-02-17T15:30:37+00:00",
        "source_name": "Unknown source",
        "author": "Associated Press",
        "category": "general",
        "content": "Error extracting content: Article `download()` failed with 403 Client Error: Forbidden for url: https://torontosun.com/sports/basketball/the-nba-all-star-verdicts-are-in-and-the-player-reaction-to-the-mini-tournament-is-mixed on URL https://torontosun.com/sports/basketball/the-nba-all-star-verdicts-are-in-and-the-player-reaction-to-the-mini-tournament-is-mixed"
    },
    {
        "title": "2025 NFL Draft Scouting Report: Marshall EDGE Mike Green",
        "url": "https://steelersdepot.com/2025/02/2025-nfl-draft-scouting-report-marshall-edge-mike-green/",
        "published_date": "2025-02-17T15:30:36+00:00",
        "source_name": "Unknown source",
        "author": "Steven Pavelka",
        "category": "general",
        "content": "From now until the 2025 NFL Draft, we will scout and create profiles for as many prospects as possible, examining their strengths, weaknesses, and what they can bring to an NFL franchise. These players could be potential top 10 picks, down to Day 3 selections, and priority undrafted free agents. Today, a scouting report on Marshall EDGE Mike Green.\n\n#15 MIKE GREEN/EDGE MARSHALL – 6031, 251 POUNDS (R-SOPHOMORE)\n\nPlayer Ht/Wt Hand Size Arm Length Wingspan Mike Green 6031/251 8 5/8 32 1/4 77 1/4 40-Yard Dash 10-Yard Dash Short Shuttle 3-Cone N/A N/A N/A N/A Broad Jump Vertical Bench Press N/A N/A N/A\n\nGood\n\n– Major uptick in production for his final season in college\n\n– Has a nice swim move in his arsenal that he uses in both the run and pass game\n\n– Uses his quickness along with finesse to make the tackle use false steps and blow by them\n\n– Patient and disciplined defender who will stay put and contain backside in case of a running back cuts back to his side\n\n– Uses a lot of pre-snap movement to confuse the offensive linemen on which gap he will be attacking\n\n– Has really solid game speed\n\n– Due to skill set, would be effective on stunts\n\n– Good bend to get past tackles\n\n– Handles double teams surprisingly well\n\n– High ceiling, especially if he puts on some more weight to use power more often\n\nBad\n\n– Limited experience with only having one college season of starting playing time\n\n– Handful of times on tape will not take a direct path to the ball carrier but instead, use false steps as if he is thinking too much about where the ball is heading when he should just play off instincts\n\n– Linemen have a pretty easy time throwing him out of the play if he chooses a shoulder to attack\n\n– Finishing plays seems to be an issue at times, which can be due to over-pursuing\n\n– Needs to incorporate power more into his rush attempts\n\n– Looks lost when they drop him into coverage\n\n– Allows linemen to get inside hands on him, which neutralizes his rush\n\n– Played in the Sun Belt with an easy schedule\n\nBio\n\n– Six games played for Virginia in 2021 and 26 games played for Marshall from 2023 to 2024\n\n– 131 tackles, 22.5 sacks, four forced fumbles, and 33 tackles for loss in his college career\n\n– 84 tackles, 17 sacks, three forced fumbles, and 23 tackles for loss in 2024\n\n– No notable injuries\n\n– Three-star ATH in his 2021 high school class from Williamsburg, VA\n\n– Finished second in Virginia in state wrestling as a sophomore and third as a junior\n\n– Played linebacker and tight end in high school but did not play in the 2020 season\n\n– Played no games for Virginia in 2022, entered the transfer portal following that season\n\n– In 2024, led the FBS in sacks (17.0), sack yardage (144), tackles for loss (22.5), TFL yardage (155), and tackles by a defensive lineman (84).\n\n– 2024 First Team All-American, 2024 Sun Belt Player of the Year, and 2024 First-team All-Sun Belt\n\nTape Breakdown\n\nMike Green needed a strong Senior Bowl performance to prove to scouts that he wasn’t just a one-year wonder. He did exactly that and more, exceeding expectations with a dominant showing, highlighted by a play where he overpowered Oregon offensive tackle Josh Conerly. Conerly, projected as a late first to early second-round pick, found himself on his back, a testament to Green’s power and explosiveness. After making his mark on this play, Green withdrew from the Senior Bowl and shifted his focus to NFL Draft preparation.\n\nI have watched Mike Green run through Josh Conerly 100 times pic.twitter.com/iaZK56hDen — Big Game Bengal (@BengalYouTube) January 29, 2025\n\nEven though I don’t see Green play with that same strength in a normal game, he sometimes flashes solid power. Here, against Southern Miss, he blows up a pulling guard that then gets in the way of the running backs’ path. Green single-handedly blew up this entire run play by overpowering the guard and clogging the lane. This is what I wanted to see more consistently from him.\n\nYou’ll see a lot from Green, a decent amount of pre-snap movement, and then some misdirection with a swim to blow past the offensive tackle. Very subtly, in this play, Green takes a step or two towards the B-gap that he is lined up in front of before crossing the tackle’s face and hitting his right shoulder with a swim. That subtle move gets the tackle moving left while Green uses his great game speed to blow by him. This has worked all season for Green, with offensive tackles having no answer.\n\nEven though Green doesn’t use a spin as often as he uses his swim, it can be just as impactful. My favorite example of Green executing the spin came against Ohio State on this play. He closes the space and then starts moving in towards the tackle’s left shoulder before spinning back out to the tackle’s right side and blowing past him with, once again, that great game speed. Doing this is impressive, but pulling it out against the hardest team you face all season makes it even better.\n\nFinally, I want to mention Green’s ability to handle double teams. He has been shockingly successful against them, as shown by the tape I watched. Given his undersized frame, I did not expect this. Here, he attacks the B-gap and powers through even with the help coming halfway through the rep. He has plays like this in multiple of the games I watched. His strength may not come up on tape by throwing a tackle on their back, but it shows up on plays like this, where he fights through contact from two offensive linemen.\n\nConclusion\n\nMike Green is a guy who has a noticeable chip on his shoulder. From being a three-star high school prospect and not playing much at Virginia to leading the nation in sacks and tackles for loss in 2024, Green has shot up draft boards like crazy. On tape, he shows good overall versatility, doing everything at least at a solid enough level. There are things he can refine, like his run-stopping ability with two-gapping or his ability to finish plays by not over-pursuing.\n\nHowever, his deep array of moves to rush the passer and his overall discipline are a great base for a defensive coordinator to work with. Some may question Green due to his lack of size, withdrawing himself from the Senior Bowl early, and playing in a weaker conference, but I feel he has done enough to warrant a high draft pick.\n\nMy player comparison for Mike Green is Alex Highsmith. Size-wise, their height, weight, hand size, and arm length are all around the same. Both struggled to get playing time in college before their second to last year, when they became impact players. Also, both had explosive final college seasons, where they led at least their conference in tackles for loss or sacks, if not the entire FBS.\n\nWhen looking at their play styles, you’ll see both of them be smart and disciplined by sealing the backside in case there is a cutback to them in the run game. When watching both, I think they are about on the same level when it comes to their spins and bendability. If Mike Green goes to a team with another certified star rushing from the other side, don’t be surprised if Green puts up a 14.5 sack season like Highsmith did in his breakout 2022 season.\n\nProjection: Mid to Late Day One\n\nDepot Draft Grade: 8.4 – Second Round (Future Quality Starter)\n\nGames Watched: Senior Bowl (2025), Southern Miss (2024), Virginia Tech (2024), Louisiana-Monroe (2024), Louisiana (2024)"
    },
    {
        "title": "X is blocking links to Signal, a secure messaging platform used by federal workers",
        "url": "https://techcrunch.com/2025/02/17/x-is-blocking-links-to-signal-a-secure-messaging-platform-used-by-federal-workers/",
        "published_date": "2025-02-17T15:30:29+00:00",
        "source_name": "Unknown source",
        "author": "Rebecca Bellan",
        "category": "technology",
        "content": "Elon Musk’s X (formerly Twitter) is blocking links to Signal.me, a URL shortener used by the private messaging app Signal that allows users to send out a link that’s used to contact them directly through the service. The blocks, which impact direct messages, public posts, and profile pages, were first spotted by the blog Disruptionist.\n\nThe change comes as DOGE (the Department of Government Efficiency) takes aim at federal agencies, including NASA and the Department of Education, leaving workers turning to Signal’s encrypted messaging platform to securely share information and blow the whistle on potentially harmful activity.\n\nNearly 10,000 federal workers have been fired across the government as Musk’s DOGE works to slash federal spending and shut down entire agencies, like USAID.\n\nX is blocking links to Signal.me. Image Credits:Rebecca Bellan\n\nTechCrunch has attempted to share a link via post and DM. When trying to share via a post, a message pops up that says: “Something went wrong, but don’t fret – let’s give it another shot.”\n\nAny message with a link to Signal.me also fails to send, and a pop-up appears that says, “This request looks like it might be automated. To protect our users from spam and other malicious activity, we can’t complete this action right now. Please try again later.”\n\nTechCrunch reached out to X for comment.\n\nMusk is a self-described free-speech advocate, but he frequently attacks publications and individuals who have spoken out against his actions. He has also been accused of blocking accounts on X of people who have disagreed with him."
    },
    {
        "title": "Decrypting the Angel Reese & Paige Bueckers Effect: Women Representation & Brand Marketing Through a DoorDash Lens",
        "url": "https://www.essentiallysports.com/flagship-think-tank-news-decrypting-the-angel-reese-paige-bueckers-effect-women-representation-brand-marketing-through-a-doordash-lens/",
        "published_date": "2025-02-17T15:30:21+00:00",
        "source_name": "Unknown source",
        "author": "Harsh Rana",
        "category": "sports",
        "content": "Angel Reese and Paige Bueckers aren’t just changing the game on the court—they’re rewriting the playbook for athlete branding and marketing. Reese recently secured a deal with Reebok where she has her own signature shoe ready set ready to be launched in 2026. She also collaborated with McDonald’s for an Angel Reese Special meal, making her the first female athlete to get a national meal endorsement by the company. Her partnership further extends to brands like Goldman Sachs, Beats by Dre, Tampax, Airbnb, Amazon, PlayStation and more.\n\nOn the other hand, Bueckers trademarked her nickname “Paige Buckets” in 2021, showcasing her sharp acumen in personal branding. Furthermore, she designed her own player edition sneaker with Nike. The Nike G.T. Hustle 3 is the first Nike Player Edition shoe celebrating an NIL athlete. She further has partnerships with brands like Topps, Dunkin’, UConn NIL Store, Leaf Trading Cards, and more. These two stars are prime examples of how to build a personal brand that resonates with your story.\n\nIn the first episode of our EssentiallySports–Think Tank Season 2 podcast, our host, Trey Holder, and Jack Adler, the founder of Out2Win sparked a conversation about how marketable the duo is. Emery Barnes, Marketing, Brand & Creative at DoorDash emphasized how crucial it is for athletes to have a brand identity. Barnes recalled a conversation with one of his clients. “In today’s world, you’ve got to have a brand, whether you’re an athlete or an entertainer,” quipped Barnes based on his conversation with the client. Gone are the days when you would be selected based on your performance. Barnes summarised that it’s no longer just about performance; it’s about fan engagement.\n\nADVERTISEMENT Article continues below this ad\n\nBeyond Endorsements: How Angel Reese and Paige Bueckers are Redefining Athlete Branding\n\nBarnes believes that the introduction of NIL (Name, Image, Likeness) deals, has completely changed the game. College athletes can now earn money from endorsements and sponsorship, something which was prohibited. However, Barnes believes that despite this brilliant opportunity, most of the advertisements and campaigns are just bland and generic. This is an area where Angel Reese and Paige Bueckers have stood out from the crowd. “I don’t need you to follow the script precisely. Talk about all our key messaging points, but do it in a way that’s authentic to you and your audience,” Barnes advised.\n\nDoorDash’s marketing team used Anthony Edwards as an example of how his larger-than-life personality fueled his rise. Surely, “he talks s**t but he backs it up,” Barnes quipped. He has amassed unfathomable success by being himself. His $50 million partnership with Adidas and the Sprite deal are testament to that.\n\nADVERTISEMENT Article continues below this ad\n\nEmery Barnes believes that Angel Reese and Paige Bueckers are doing something similar. Basketball Hall of Famer Shaquille O’Neal, Reebok’s president, kicked off his athlete roster by signing Reese in 2023. Together with Reebok, Bayou Barbie wants to inspire people to “express themselves unapologetically and look good while doing it.” Bueckers’ personal shoe by Nike features a personal message from her father and pays tribute to both of her homes.\n\nThe female duo is not only selling products but is turning their personal stories into something bigger. They are sharing part of their lives, making the fans feel involved in their personal journey. While women’s sport is on an upward trajectory, it still lags behind in terms of marketing opportunities. Campaigns like these showcase what needs to be done to bridge that gap.\n\nDoorDash’s creative believes that the narrative around athletes has changed. It’s not just about performance anymore, “it’s important to market yourself as an athlete and just think about what is the story you are gonna tell,” claimed Barnes. And it looks like Reese and Bueckers are at the forefront of this revolution. They are not only making themselves bigger but are showcasing how personal branding can foster meaningful connections. This reflects the ThinkTank initiative of creating a brand that will influence the future of sports content by cultivating connections between athletes, fans, and brands.\n\nADVERTISEMENT Article continues below this ad\n\nThink Tank is a premium initiative of EssentiallySports that brings together the brightest minds to discuss strategy, leadership, change, and opportunities in the world of sports content business. We strive to deliver thought leadership that sparks change and unlocks new opportunities. This is EssentiallySports Think Tank—Where Sports Meets Smart Content.\n\nAlso Read: Employee Engagement Redefined: DoorDash’s Grassroot Strategy For Optimal Customer Satisfaction"
    },
    {
        "title": "Kerala CM Says Startups Have Shown Significant Growth Under His Rule",
        "url": "https://www.deccanchronicle.com/southern-states/kerala/kerala-cm-says-startups-have-shown-significant-growth-under-his-rule-1861774",
        "published_date": "2025-02-17T15:30:12+00:00",
        "source_name": "Unknown source",
        "author": "DC Correspondent",
        "category": "general",
        "content": "Thiruvananthapuram: Kerala PCC president K Sudhakaran on Monday said Shashi Tharoor praising the Kerala government's performance in ease of doing business and the start-up sector does not go in line with the party's official position.\n\nSudhakaran told reporters here that he had discussed the matter with Tharoor. \"I have shared my thoughts with him. Taking advantage of our rapport, I offered him some good advice,\" he said, adding that Tharoor's comments reflect his personal opinion.\n\nMany senior leaders in Congress believe that Tharoor should not have written the article praising the policies of the LDF government. However, the Thiruvananthapuram MP has defended his remarks, stating that he would consider making changes if the party leadership points out any discrepancies in his observations.\n\nFormer MP K Muraleedharan stated that Shashi Tharoor's remarks were a clear violation of party discipline. \"Tharoor has contested from the Thiruvananthapuram parliamentary constituency four times and has won. He should not forget that thousands of Congress and UDF workers toiled day and night for his victories. In a few months, these grassroots workers will be contesting the local body elections. At the very least, the MP should have considered the negative impact his comments could have on the victory prospects of these workers,\" he said.\n\nMeanwhile, Kerala Chief Minister Pinarayi Vijayan said on Monday that the startup sector has experienced significant growth during the LDF government's tenure.\n\nOver the past eight years, the number of startups has risen to 6200, creating approximately 60,000 jobs and attracting investments worth Rs 5,800 crore.\n\nIn 2016, the available business space was just 15,000 square feet, but now Kerala boasts more than 10 lakh sq feet of incubation space. The government has set a target of achieving 15,000 startups by 2026, which is expected to create 1 lakh job opportunities.\n\nThe chief minister's comments are particularly significant in the wake of Shashi Tharoor's praise for the Kerala government's start-up policy. Thiruvananthapuram has faced criticism from his party for commending the LDF government's achievements."
    },
    {
        "title": "PrairieSky Royalty: Slowly Turning Bullish (Rating Upgrade)",
        "url": "https://seekingalpha.com/article/4758930-prairiesky-royalty-slowly-turning-bullish?source=feed_all_articles",
        "published_date": "2025-02-17T15:30:00+00:00",
        "source_name": "Unknown source",
        "author": "Unknown author",
        "category": "general",
        "content": "He is the leader of the investment group European Small Cap Ideas which offers exclusive access to actionable research on appealing Europe-focused investment opportunities not found elsewhere. The a focus is on high-quality ideas in the small-cap space, with emphasis on capital gains and dividend income for continuous cash flow. Features include: two model portfolios - the European Small Cap Ideas portfolio and the European REIT Portfolio, weekly updates, educational content to learn more about the European investing opportunities, and an active chat room to discuss the latest developments of the portfolio holdings. Learn more\n\nAnalyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
    }
]