[
    {
        "title": "Gen AI Adoption Not Moving At Speed Of Technology, Agentic AI No Silver Bullet, Reveals Deloitte Survey",
        "url": "https://www.ndtvprofit.com/technology/gen-ai-adoption-not-moving-at-speed-of-technology-agentic-ai-no-silver-bullet-finds-deloitte-survey",
        "content": "While generative artificial intelligence technology continues to advance at incredible speed, organisational change has been hard work, and a majority of executives believe their experiments with the technology will not be fully scaled in the coming months.\n\nAccording to a recent Deloitte report, more than two-thirds of respondents said that 30% or fewer of their experiments will be fully scaled in the next three to six months. Despite longer than expected time to value, nearly three-quarters of respondents also reported that their most advanced gen AI initiative is meeting or exceeding ROI expectations. Cybersecurity and IT functions are leading the way in terms of ROI and successful scaling.\n\nWhile agentic AI is seen as a key enabler of sustainable value, regulatory uncertainty and risk management remain key barriers, the report— based on a survey of 2,773 director- to C-suite-level respondents across 14 countries—noted."
    },
    {
        "title": "Mules that provided aid after Hurricane Helene struck down on road",
        "url": "https://www.wral.com/story/mules-that-provided-aid-after-hurricane-helene-struck-down-on-road/21863436/",
        "content": "**This image is for use with this specific article only** Mules are helping deliver supplies to North Carolina residents devastated by Hurricane Helene, according to Mountain Mule Packer Ranch. Photo credit: Mountain Mule Packer Ranch via CNN Newsource Dateline: Mount Ulla, North Carolina.\n\nAmong the idyllic landscapes of Mount Ulla, North Carolina, there is a sadness wafting through the community where two mules and a horse that carried supplies to victims of Hurricane Helene were hit and killed last weekend.\n\nThe three animals, named Vader, Kev and Amigo, were struck by a semitruck on a road. A tree fell on a fence, leaving an opening for the three faithful equines to escape their pasture, according to a post on the Mountain Mule Packer Ranch Facebook page.\n\n“We could not be more heartbroken over this incredible loss, and it is with great pain that we share it with you, as we know many of you have also fallen in love with these sweet animals,” the ranch said in the post.\n\nThe packs of mules trekked through treacherous roadways and rocky mountain sides to deliver food, water and building supplies to those devastated by the hurricane. The mules helped deliver disaster relief from western North Carolina to eastern Tennessee, the ranch said on social media.\n\nThe organization’s mission is to provide mule training and packing instruction for civilian and military groups. The animals are equipped to carry gear and resources for weapon groups, communication teams and medical teams in remote environments, according to the ranch.\n\nThe hard work of these mules and their tireless efforts united the community after the tragedy of Hurricane Helene, Mountain Mule Packers’ co-founder Michele Toberer said. Since the devastating cyclone hit Appalachia in September, the mules have played an integral part in relief efforts, especially in areas inaccessible by vehicles, the animals’ owner said.\n\nHurricane Helene was a Category 4 storm that created a 500-mile path of destruction from Florida to North Carolina with catastrophic flooding, damaging winds and power outages. Helene is one of the costliest tropical cyclones to ever hit the United States, resulting in nearly $80 billion in damage. At least 106 people were killed as a result of the storm, according to the North Carolina Department of Health and Human Services.\n\nIn November, the ranch created a Christian non-profit disaster response organization known as Mission Mules to continue hurricane relief. The community was unified by their work in a beautiful way, Toberer explained.\n\n“They brought more than just supplies to people. It’s that they were bringing hope to people, because there were so many people that felt like they were forgotten,” Toberer said. “Just the fact that these mules were coming brought a smile to their face.”\n\nDespite this tragic loss, the disaster relief organization pushes forward with its mission. The team and its mules are hosting a distribution event in Black Mountain, North Carolina for those continuing to be impacted by Helene’s aftermath.\n\n“The thought of leaving on Saturday without the other three is already heartbreaking for us, so we’re preparing ourselves for that,” Toberer said. “Their work ethic and what they’ve done with the people in western North Carolina taught us in the last few months that when something unimaginable happens, we still keep going.”\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved."
    },
    {
        "title": "New Special Routes for Lavrio-Agios Efstratios-Lemnos-Kavala Line",
        "url": "https://www.argophilia.com/news/lavrio-agios-efstratios-lemnos-kavala/240341/",
        "content": "The usual operator for the Lavrio-Agios Efstratios-Lemnos-Kavala line bailed on their responsibilities. They didn’t show up to renew their contract properly, leaving the Ministry of Shipping scrambling for solutions. It gets sketchier. When the Ministry opened a public call for substitutes, the market shrugged. Ships were available partially but not for the entire route. Smooth planning? Forget it.\n\nOn top of this supply chain drama, a court case muddied the waters. A claim landed at the Council of State, halting plans for the permanent line. Everyone’s on hold, waiting for the decision. Cue corporate lawyers popping champagne while commuters grind their teeth. Until then, the Ministry greenlit stopgap measures and a series of “new special routes” to keep things moving, sort of.\n\nThe Patchwork Schedule\n\nSo here’s the plan—grab your calendars and maybe a shot of ouzo:\n\nBlue Star Chios and Blue Star Mykonos will spice up their Tuesday runs from Mytilene. Starting February 18, 2025, they’ll swing by Agios Efstratios, hit Lemnos, and dock at Kavala on Wednesday.\n\nwill spice up their Tuesday runs from Mytilene. Starting February 18, 2025, they’ll swing by Agios Efstratios, hit Lemnos, and dock at Kavala on Wednesday. Nisos Samos steps up for Saturday service from Mytilene to Lemnos and Kavala on February 22, 2025, with a return trip on Sunday. If it gets busy, this ride could stick around on Saturdays.\n\nsteps up for Saturday service from Mytilene to Lemnos and Kavala on February 22, 2025, with a return trip on Sunday. If it gets busy, this ride could stick around on Saturdays. RoRo Talos will tackle a marathon route from Piraeus to Ikaria, Samos, Chios, Mytilene, Lemnos, and Kavala for heavy-duty logistics. This happens February 17–21, 2025. Think of it as the grand tour of the Aegean.\n\nwill tackle a marathon route from Piraeus to Ikaria, Samos, Chios, Mytilene, Lemnos, and Kavala for heavy-duty logistics. This happens February 17–21, 2025. Think of it as the grand tour of the Aegean. Thalassitis rounds out the lineup with weekly trips from Piraeus to Chios, Mytilene, Lemnos, and either Thessaloniki or Kavala.\n\nHere’s the kicker: Is Kavala being dropped temporarily from the Lavrio route? Purely provisional. Once the legal dust settles, expect the Lavrio-Agios Efstratios-Lemnos-Kavala flow to resume its groove. Kavala’s a non-negotiable connection point for the Ministry; there are no ifs, ands, or buts about it.\n\nWhat’s Next for the Islands?\n\nIsland mayors and MPs recently huddled with the Minister to hash out a master plan. The goal? Stability. By 2029, multi-year contracts (four-year minimum) will put sturdier ships into play. Hooray for fewer delays and better passenger seats—or so we hope. Plus, higher funding incentives aim to attract newer vessels for 2025-2029. It’s about time, right?\n\nMeanwhile, the Lemnos-Alexandroupoli line via Samothraki continues to thrive every summer from June 2 to August 31. This backup option has low-key become a rising star. Lemnos fans might consider booking sooner rather than later.\n\nThe Bottom Line\n\nTo call the Lavrio-Agios Efstratios-Lemnos-Kavala disruptions a headache would be putting it mildly. The Ministry is shaking up schedules to patch things up until permanent solutions can sail in—literally. If you’ve got travel plans, keep checking schedules, and maybe keep an eye on that Council of State decision. For now, buckle up (or, well, dock your boat) and ride it out.\n\nFor official updates, visit the Ministry of Shipping’s Official Page."
    },
    {
        "title": "Oodie has just launched football-based jackets, blankets and coats",
        "url": "https://www.scotsman.com/recommended/oodie-has-just-launched-football-based-jackets-blankets-and-coats-4963229",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "Oodie has just launched football-based jackets, blankets and coats",
        "url": "https://www.burnleyexpress.net/recommended/oodie-has-just-launched-football-based-jackets-blankets-and-coats-4963229",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "Australian team arrives in Pakistan for Champions Trophy",
        "url": "https://www.deccanchronicle.com/sports/australian-team-arrives-in-pakistan-for-champions-trophy-1861721",
        "content": "Lahore: The Australian cricket team arrived in Pakistan on Monday to participate in the upcoming ICC Champions Trophy. The tournament begins with a match between hosts Pakistan and New Zealand in Karachi on Wednesday.\n\n\n\nPakistan are also the defending champions having won the last edition of the tournament in 2017 in the UK where they beat India in the title clash.\n\n\"The Australian cricket team has arrived in Lahore for the @ICC #ChampionsTrophy 2025! They will play their first match of the tournament on 22 February against England at the Gaddafi Stadium,\" the Pakistan Cricket Board (PCB) posted on X.\n\nThe team landed in two separate groups. The first batch, which included captain Steve Smith, coaches, and support staff, arrived from Colombo via Dubai.\n\nThe second group, comprising 15 players and two additional members of the support staff, followed the same route and reached Lahore later the same day.\n\nLike India, who will be playing all their matches in Dubai as per the hybrid model agreement, the Australian team will also not feature in any warm-up matches, as they were very recently involved in a two-match ODI series against Sri Lanka, which they lost 2-0.\n\nAfter their opener against traditional rivals England, Australia will play their second match against South Africa on February 25 at Rawalpindi Cricket Stadium, followed by a final group-stage outing against Afghanistan on February 28, again at Gaddafi Stadium.\n\nAustralia squad: Steve Smith (captain), Sean Abbott, Alex Carey, Ben Dwarshuis, Nathan Ellis, Jake Fraser-McGurk, Aaron Hardie, Travis Head, Josh Inglis, Spencer Johnson, Marnus Labuschagne, Glenn Maxwell, Tanveer Sangha, Matthew Short, Adam Zampa."
    },
    {
        "title": "Oodie has just launched football-based jackets, blankets and coats",
        "url": "https://www.wigantoday.net/recommended/oodie-has-just-launched-football-based-jackets-blankets-and-coats-4963229",
        "content": "Error: Page returned status code 403"
    },
    {
        "title": "Over 2,800 traffic violations recorded in Cyprus over just six days",
        "url": "https://famagusta-gazette.com/over-2800-traffic-violations-recorded-in-cyprus-over-just-six-days/",
        "content": "Police officers filed 987 complaints regarding exceeding the speed limit, 163 complaints for failure to use seat belts by drivers and passengers, 12 complaints for failure to use a protective helmet and 185 complaints for using a mobile phone while driving.\n\nIn addition, 75 complaints were filed for driving under the influence of alcohol, 61 complaints for illegal parking, 20 for parking in disabled spaces and 1,312 complaints for committing other traffic offences.\n\nAdditionally, 26 complaints arose regarding drug tests, 40 car seizures and 14 two-wheeled vehicle seizures."
    },
    {
        "title": "​Return Comparison: SIP or PPF? Which can create larger corpus for Rs 1,30,000 annual investment?",
        "url": "https://www.zeebiz.com/personal-finance/news-return-comparison-sip-vs-ppf-which-investment-can-build-larger-corpus-for-rs-130000-annual-contribution-calculations-inside-347543",
        "content": "Systematic Investment Plans (SIPs) and the Public Provident Fund (PPF) are two prominent choices for individuals seeking long-term savings and wealth creation. Both investment options offer distinct advantages, catering to different risk appetites and financial goals. This article compares SIP and PPF returns for an annual investment of Rs 1.3 lakh to determine which can generate a larger corpus.\n\nSIP: Market-Linked Growth with Potentially High Returns\n\nSIPs involve disciplined investments in mutual funds, where a fixed amount is debited regularly from the investor’s account. While SIPs offer the potential for substantial returns, they are subject to market volatility and risks.\n\nHow SIP Works:\n\nFixed amounts are invested periodically, allowing for disciplined savings.\n\nReturns are influenced by the Net Asset Value (NAV) of the selected mutual fund.\n\nCompounding and market growth over time amplify returns.\n\nExample: SIP Returns\n\nMonthly Investment: Rs 10,850\n\nTotal Invested Amount: Rs 19,53,000\n\nTotal Interest Earned: Rs 35,21,650\n\nMaturity Value: Rs 54,74,650\n\nSIPs, driven by market performance, can yield a robust corpus, ideal for investors comfortable with market risks.\n\nPPF: Government-Backed Security and Steady Growth\n\nPPF is a low-risk investment option, offering guaranteed returns and tax benefits. Backed by the government, it’s suited for risk-averse individuals seeking a stable saving tool.\n\nKey Features of PPF:\n\nInterest Rate: 7.1% per annum (compounded annually).\n\nLock-in Period: 15 years, extendable in 5-year blocks.\n\nAnnual Investment Limit: Rs 500 to Rs 1.5 lakh.\n\nExample: PPF Returns\n\nTotal Invested Amount: Rs 19,50,000\n\nTotal Interest Earned: Rs 15,75,781\n\nMaturity Value: Rs 35,25,781\n\nPPF offers security and tax-free returns, albeit with a lower growth trajectory compared to SIPs.\n\nSIP vs PPF: The Key Takeaway\n\nHigher Returns : SIPs have the potential for a larger corpus but involve market-linked risks.\n\n: SIPs have the potential for a larger corpus but involve market-linked risks. Secure Growth: PPF ensures safety and steady returns, ideal for conservative investors.\n\nConclusion:\n\nFor those willing to embrace market risks, SIPs can generate a higher corpus over time.\n\nFor individuals prioritizing safety and tax efficiency, PPF is a more secure choice.\n\nDisclaimer: This comparison is for informational purposes. Investment decisions should align with individual financial goals, risk tolerance, and investment horizon."
    },
    {
        "title": "Costa says Europe needs to negotiate ‘new security architecture’ with Russia",
        "url": "https://www.ft.com/content/9fb2c865-8183-4b2c-86a0-bd55e86728da",
        "content": "Accessibility helpSkip to navigationSkip to contentSkip to footer\nSign In\nSubscribe\nOpen side navigation menuOpen search bar\nSubscribeSign In\nMenuSearch\nHome\nWorld\nUS\nCompanies\nTech\nMarkets\nClimate\nOpinion\nLex\nWork & Careers\nLife & Arts\nHTSI\nFinancial Times\nSubscribeSign In\nUS Politics 2025\nSubscribe to unlock this article\nCosta says Europe needs to negotiate ‘new security architecture’ with Russia\nLimited time offer\nSave 40% on Standard Digital\nSave 40%\nWant a deeper look?\nExplore our recommended subscriptions\nExplore more offers.\nTrial\n€1 for 4 weeks\nThen €69 per month. Complete digital access to quality FT journalism. Cancel anytime during your trial.\nSelect\nGlobal news & analysis\nExpert opinion\nFT App on Android & iOS\nFT Edit app\nFirstFT: the day's biggest stories\n20+ curated newsletters\nFollow topics & set alerts with myFT\nFT Videos & Podcasts\n20 monthly gift articles to share\nLex: FT's flagship investment column\n15+ Premium newsletters by leading experts\nFT Digital Edition: our digitised print edition\nPremium & FT Weekend Print\nFor the price of Premium\nwas €725 now €659 per year\nGet Premium & FT Weekend Print edition for the price of Premium. Complete digital access to quality analysis and expert insights, complemented with our award-winning Weekend Print edition.\nSelect\nFT Weekend Print delivery\nPlus\nEverything in Premium Digital\nPrint\n€199 for your first year\nFT newspaper delivered Monday-Saturday, plus FT Digital Edition delivered to your device Monday-Saturday.\nSelect\nWeekday Print Edition\nFT Weekend\nFT Digital Edition\nGlobal news & analysis\nExpert opinion\nSpecial features\nExclusive FT analysis\nTerms & Conditions apply\nExplore our full range of subscriptions.\nFor individuals\nDiscover all the plans currently available in your country\nDigitalPrintPrint + Digital\nFor multiple readers\nDigital access for organisations. Includes exclusive features and content.\nFT Professional\nCheck whether you already have access via your university or organisation.\nWhy the FT?\nSee why over a million readers pay to read the Financial Times.\nFind out why\nUseful links\nMarkets data delayed by at least 15 minutes. © THE FINANCIAL TIMES LTD 2025. FT and ‘Financial Times’ are trademarks of The Financial Times Ltd. The Financial Times and its journalism are subject to a self-regulation regime under the FT Editorial Code of Practice.\nSubscribe for full access"
    }
]